layer {
  name: "input"
  type: "ImageData"
  top: "input"
  top: "trash"
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "./datas/flower_dataset/train_source27.txt"
    batch_size: 1
    shuffle: false
    new_height: 192
    new_width: 192
    is_color: false
  }
}
layer {
  name: "Convolution1"
  type: "Convolution"
  bottom: "input"
  top: "Convolution1"
  convolution_param {
    num_output: 16
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "ReLU1"
  type: "ReLU"
  bottom: "Convolution1"
  top: "Convolution1"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Convolution2"
  type: "Convolution"
  bottom: "Convolution1"
  top: "Convolution2"
  convolution_param {
    num_output: 16
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "conv1"
  type: "ReLU"
  bottom: "Convolution2"
  top: "Convolution2"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Pooling1"
  type: "Pooling"
  bottom: "Convolution2"
  top: "Pooling1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "poo1"
  type: "ReLU"
  bottom: "Pooling1"
  top: "Pooling1"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Convolution3"
  type: "Convolution"
  bottom: "Pooling1"
  top: "Convolution3"
  convolution_param {
    num_output: 32
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "ReLU2"
  type: "ReLU"
  bottom: "Convolution3"
  top: "Convolution3"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Convolution4"
  type: "Convolution"
  bottom: "Convolution3"
  top: "Convolution4"
  convolution_param {
    num_output: 32
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "conv2"
  type: "ReLU"
  bottom: "Convolution4"
  top: "Convolution4"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Pooling2"
  type: "Pooling"
  bottom: "Convolution4"
  top: "Pooling2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "poo2"
  type: "ReLU"
  bottom: "Pooling2"
  top: "Pooling2"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Convolution5"
  type: "Convolution"
  bottom: "Pooling2"
  top: "Convolution5"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "ReLU3"
  type: "ReLU"
  bottom: "Convolution5"
  top: "Convolution5"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Convolution6"
  type: "Convolution"
  bottom: "Convolution5"
  top: "Convolution6"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "conv3"
  type: "ReLU"
  bottom: "Convolution6"
  top: "Convolution6"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Pooling3"
  type: "Pooling"
  bottom: "Convolution6"
  top: "Pooling3"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "poo3"
  type: "ReLU"
  bottom: "Pooling3"
  top: "Pooling3"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Convolution7"
  type: "Convolution"
  bottom: "Pooling3"
  top: "Convolution7"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "ReLU4"
  type: "ReLU"
  bottom: "Convolution7"
  top: "Convolution7"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Convolution8"
  type: "Convolution"
  bottom: "Convolution7"
  top: "Convolution8"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "conv4"
  type: "ReLU"
  bottom: "Convolution8"
  top: "Convolution8"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Pooling4"
  type: "Pooling"
  bottom: "Convolution8"
  top: "Pooling4"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "poo4"
  type: "ReLU"
  bottom: "Pooling4"
  top: "Pooling4"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Convolution9"
  type: "Convolution"
  bottom: "Pooling4"
  top: "Convolution9"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "ReLU5"
  type: "ReLU"
  bottom: "Convolution9"
  top: "Convolution9"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Convolution10"
  type: "Convolution"
  bottom: "Convolution9"
  top: "Convolution10"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "conv5"
  type: "ReLU"
  bottom: "Convolution10"
  top: "Convolution10"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Pooling5"
  type: "Pooling"
  bottom: "Convolution10"
  top: "Pooling5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "poo5"
  type: "ReLU"
  bottom: "Pooling5"
  top: "Pooling5"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Convolution11"
  type: "Convolution"
  bottom: "Pooling5"
  top: "Convolution11"
  convolution_param {
    num_output: 512
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "ReLU6"
  type: "ReLU"
  bottom: "Convolution11"
  top: "Convolution11"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Convolution12"
  type: "Convolution"
  bottom: "Convolution11"
  top: "Convolution12"
  convolution_param {
    num_output: 512
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "feature"
  type: "ReLU"
  bottom: "Convolution12"
  top: "Convolution12"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Deconvolution1"
  type: "Deconvolution"
  bottom: "Convolution12"
  top: "Deconvolution1"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU7"
  type: "ReLU"
  bottom: "Deconvolution1"
  top: "Deconvolution1"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "DummyData1"
  type: "DummyData"
  top: "DummyData1"
  dummy_data_param {
    shape {
      dim: 1
      dim: 256
      dim: 12
      dim: 12
    }
  }
}
layer {
  name: "Crop1"
  type: "Crop"
  bottom: "Deconvolution1"
  bottom: "DummyData1"
  top: "Crop1"
  crop_param {
    axis: 2
    offset: 0
  }
}
layer {
  name: "deconv5"
  type: "Concat"
  bottom: "Crop1"
  bottom: "Convolution10"
  top: "deconv5"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Convolution13"
  type: "Convolution"
  bottom: "deconv5"
  top: "Convolution13"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "ReLU8"
  type: "ReLU"
  bottom: "Convolution13"
  top: "Convolution13"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Convolution14"
  type: "Convolution"
  bottom: "Convolution13"
  top: "Convolution14"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "conv6"
  type: "ReLU"
  bottom: "Convolution14"
  top: "Convolution14"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Deconvolution2"
  type: "Deconvolution"
  bottom: "Convolution14"
  top: "Deconvolution2"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU9"
  type: "ReLU"
  bottom: "Deconvolution2"
  top: "Deconvolution2"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "DummyData2"
  type: "DummyData"
  top: "DummyData2"
  dummy_data_param {
    shape {
      dim: 1
      dim: 128
      dim: 24
      dim: 24
    }
  }
}
layer {
  name: "Crop2"
  type: "Crop"
  bottom: "Deconvolution2"
  bottom: "DummyData2"
  top: "Crop2"
  crop_param {
    axis: 2
    offset: 0
  }
}
layer {
  name: "deconv6"
  type: "Concat"
  bottom: "Crop2"
  bottom: "Convolution8"
  top: "deconv6"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Convolution15"
  type: "Convolution"
  bottom: "deconv6"
  top: "Convolution15"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "ReLU10"
  type: "ReLU"
  bottom: "Convolution15"
  top: "Convolution15"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Convolution16"
  type: "Convolution"
  bottom: "Convolution15"
  top: "Convolution16"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "conv7"
  type: "ReLU"
  bottom: "Convolution16"
  top: "Convolution16"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Deconvolution3"
  type: "Deconvolution"
  bottom: "Convolution16"
  top: "Deconvolution3"
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU11"
  type: "ReLU"
  bottom: "Deconvolution3"
  top: "Deconvolution3"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "DummyData3"
  type: "DummyData"
  top: "DummyData3"
  dummy_data_param {
    shape {
      dim: 1
      dim: 64
      dim: 48
      dim: 48
    }
  }
}
layer {
  name: "Crop3"
  type: "Crop"
  bottom: "Deconvolution3"
  bottom: "DummyData3"
  top: "Crop3"
  crop_param {
    axis: 2
    offset: 0
  }
}
layer {
  name: "deconv7"
  type: "Concat"
  bottom: "Crop3"
  bottom: "Convolution6"
  top: "deconv7"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Convolution17"
  type: "Convolution"
  bottom: "deconv7"
  top: "Convolution17"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "ReLU12"
  type: "ReLU"
  bottom: "Convolution17"
  top: "Convolution17"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Convolution18"
  type: "Convolution"
  bottom: "Convolution17"
  top: "Convolution18"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "conv8"
  type: "ReLU"
  bottom: "Convolution18"
  top: "Convolution18"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Deconvolution4"
  type: "Deconvolution"
  bottom: "Convolution18"
  top: "Deconvolution4"
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU13"
  type: "ReLU"
  bottom: "Deconvolution4"
  top: "Deconvolution4"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "DummyData4"
  type: "DummyData"
  top: "DummyData4"
  dummy_data_param {
    shape {
      dim: 1
      dim: 64
      dim: 96
      dim: 96
    }
  }
}
layer {
  name: "Crop4"
  type: "Crop"
  bottom: "Deconvolution4"
  bottom: "DummyData4"
  top: "Crop4"
  crop_param {
    axis: 2
    offset: 0
  }
}
layer {
  name: "deconv8"
  type: "Concat"
  bottom: "Crop4"
  bottom: "Convolution4"
  top: "deconv8"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Convolution19"
  type: "Convolution"
  bottom: "deconv8"
  top: "Convolution19"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "ReLU14"
  type: "ReLU"
  bottom: "Convolution19"
  top: "Convolution19"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Convolution20"
  type: "Convolution"
  bottom: "Convolution19"
  top: "Convolution20"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "conv9"
  type: "ReLU"
  bottom: "Convolution20"
  top: "Convolution20"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Deconvolution5"
  type: "Deconvolution"
  bottom: "Convolution20"
  top: "Deconvolution5"
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU15"
  type: "ReLU"
  bottom: "Deconvolution5"
  top: "Deconvolution5"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "DummyData5"
  type: "DummyData"
  top: "DummyData5"
  dummy_data_param {
    shape {
      dim: 1
      dim: 64
      dim: 192
      dim: 192
    }
  }
}
layer {
  name: "Crop5"
  type: "Crop"
  bottom: "Deconvolution5"
  bottom: "DummyData5"
  top: "Crop5"
  crop_param {
    axis: 2
    offset: 0
  }
}
layer {
  name: "deconv9"
  type: "Concat"
  bottom: "Crop5"
  bottom: "Convolution2"
  top: "deconv9"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Convolution21"
  type: "Convolution"
  bottom: "deconv9"
  top: "Convolution21"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "ReLU16"
  type: "ReLU"
  bottom: "Convolution21"
  top: "Convolution21"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Convolution22"
  type: "Convolution"
  bottom: "Convolution21"
  top: "Convolution22"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "conv10"
  type: "ReLU"
  bottom: "Convolution22"
  top: "Convolution22"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "flow64_1"
  type: "Convolution"
  bottom: "Convolution22"
  top: "Convolution23"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "ReLU17"
  type: "ReLU"
  bottom: "Convolution23"
  top: "Convolution23"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "flow64_2"
  type: "Convolution"
  bottom: "Convolution23"
  top: "Convolution24"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "ReLU18"
  type: "ReLU"
  bottom: "Convolution24"
  top: "Convolution24"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "flow64_3"
  type: "Convolution"
  bottom: "Convolution24"
  top: "flow64"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "Python1"
  type: "Python"
  bottom: "input"
  top: "Python1"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -2.4000000000000004, \"ty\": -2.4000000000000004}"
  }
}
layer {
  name: "Python2"
  type: "Python"
  bottom: "input"
  top: "Python2"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -2.4000000000000004, \"ty\": -1.6}"
  }
}
layer {
  name: "Concat1"
  type: "Concat"
  bottom: "Python1"
  bottom: "Python2"
  top: "Concat1"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python3"
  type: "Python"
  bottom: "input"
  top: "Python3"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -2.4000000000000004, \"ty\": -0.8}"
  }
}
layer {
  name: "Concat2"
  type: "Concat"
  bottom: "Concat1"
  bottom: "Python3"
  top: "Concat2"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python4"
  type: "Python"
  bottom: "input"
  top: "Python4"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -2.4000000000000004, \"ty\": 0}"
  }
}
layer {
  name: "Concat3"
  type: "Concat"
  bottom: "Concat2"
  bottom: "Python4"
  top: "Concat3"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python5"
  type: "Python"
  bottom: "input"
  top: "Python5"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -2.4000000000000004, \"ty\": 0.8}"
  }
}
layer {
  name: "Concat4"
  type: "Concat"
  bottom: "Concat3"
  bottom: "Python5"
  top: "Concat4"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python6"
  type: "Python"
  bottom: "input"
  top: "Python6"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -2.4000000000000004, \"ty\": 1.6}"
  }
}
layer {
  name: "Concat5"
  type: "Concat"
  bottom: "Concat4"
  bottom: "Python6"
  top: "Concat5"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python7"
  type: "Python"
  bottom: "input"
  top: "Python7"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -2.4000000000000004, \"ty\": 2.4000000000000004}"
  }
}
layer {
  name: "Concat6"
  type: "Concat"
  bottom: "Concat5"
  bottom: "Python7"
  top: "Concat6"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python8"
  type: "Python"
  bottom: "input"
  top: "Python8"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -2.4000000000000004, \"ty\": 3.2}"
  }
}
layer {
  name: "Concat7"
  type: "Concat"
  bottom: "Concat6"
  bottom: "Python8"
  top: "Concat7"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python9"
  type: "Python"
  bottom: "input"
  top: "Python9"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -1.6, \"ty\": -2.4000000000000004}"
  }
}
layer {
  name: "Concat8"
  type: "Concat"
  bottom: "Concat7"
  bottom: "Python9"
  top: "Concat8"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python10"
  type: "Python"
  bottom: "input"
  top: "Python10"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -1.6, \"ty\": -1.6}"
  }
}
layer {
  name: "Concat9"
  type: "Concat"
  bottom: "Concat8"
  bottom: "Python10"
  top: "Concat9"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python11"
  type: "Python"
  bottom: "input"
  top: "Python11"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -1.6, \"ty\": -0.8}"
  }
}
layer {
  name: "Concat10"
  type: "Concat"
  bottom: "Concat9"
  bottom: "Python11"
  top: "Concat10"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python12"
  type: "Python"
  bottom: "input"
  top: "Python12"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -1.6, \"ty\": 0}"
  }
}
layer {
  name: "Concat11"
  type: "Concat"
  bottom: "Concat10"
  bottom: "Python12"
  top: "Concat11"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python13"
  type: "Python"
  bottom: "input"
  top: "Python13"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -1.6, \"ty\": 0.8}"
  }
}
layer {
  name: "Concat12"
  type: "Concat"
  bottom: "Concat11"
  bottom: "Python13"
  top: "Concat12"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python14"
  type: "Python"
  bottom: "input"
  top: "Python14"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -1.6, \"ty\": 1.6}"
  }
}
layer {
  name: "Concat13"
  type: "Concat"
  bottom: "Concat12"
  bottom: "Python14"
  top: "Concat13"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python15"
  type: "Python"
  bottom: "input"
  top: "Python15"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -1.6, \"ty\": 2.4000000000000004}"
  }
}
layer {
  name: "Concat14"
  type: "Concat"
  bottom: "Concat13"
  bottom: "Python15"
  top: "Concat14"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python16"
  type: "Python"
  bottom: "input"
  top: "Python16"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -1.6, \"ty\": 3.2}"
  }
}
layer {
  name: "Concat15"
  type: "Concat"
  bottom: "Concat14"
  bottom: "Python16"
  top: "Concat15"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python17"
  type: "Python"
  bottom: "input"
  top: "Python17"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -0.8, \"ty\": -2.4000000000000004}"
  }
}
layer {
  name: "Concat16"
  type: "Concat"
  bottom: "Concat15"
  bottom: "Python17"
  top: "Concat16"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python18"
  type: "Python"
  bottom: "input"
  top: "Python18"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -0.8, \"ty\": -1.6}"
  }
}
layer {
  name: "Concat17"
  type: "Concat"
  bottom: "Concat16"
  bottom: "Python18"
  top: "Concat17"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python19"
  type: "Python"
  bottom: "input"
  top: "Python19"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -0.8, \"ty\": -0.8}"
  }
}
layer {
  name: "Concat18"
  type: "Concat"
  bottom: "Concat17"
  bottom: "Python19"
  top: "Concat18"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python20"
  type: "Python"
  bottom: "input"
  top: "Python20"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -0.8, \"ty\": 0}"
  }
}
layer {
  name: "Concat19"
  type: "Concat"
  bottom: "Concat18"
  bottom: "Python20"
  top: "Concat19"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python21"
  type: "Python"
  bottom: "input"
  top: "Python21"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -0.8, \"ty\": 0.8}"
  }
}
layer {
  name: "Concat20"
  type: "Concat"
  bottom: "Concat19"
  bottom: "Python21"
  top: "Concat20"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python22"
  type: "Python"
  bottom: "input"
  top: "Python22"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -0.8, \"ty\": 1.6}"
  }
}
layer {
  name: "Concat21"
  type: "Concat"
  bottom: "Concat20"
  bottom: "Python22"
  top: "Concat21"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python23"
  type: "Python"
  bottom: "input"
  top: "Python23"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -0.8, \"ty\": 2.4000000000000004}"
  }
}
layer {
  name: "Concat22"
  type: "Concat"
  bottom: "Concat21"
  bottom: "Python23"
  top: "Concat22"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python24"
  type: "Python"
  bottom: "input"
  top: "Python24"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -0.8, \"ty\": 3.2}"
  }
}
layer {
  name: "Concat23"
  type: "Concat"
  bottom: "Concat22"
  bottom: "Python24"
  top: "Concat23"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python25"
  type: "Python"
  bottom: "input"
  top: "Python25"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 0, \"ty\": -2.4000000000000004}"
  }
}
layer {
  name: "Concat24"
  type: "Concat"
  bottom: "Concat23"
  bottom: "Python25"
  top: "Concat24"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python26"
  type: "Python"
  bottom: "input"
  top: "Python26"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 0, \"ty\": -1.6}"
  }
}
layer {
  name: "Concat25"
  type: "Concat"
  bottom: "Concat24"
  bottom: "Python26"
  top: "Concat25"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python27"
  type: "Python"
  bottom: "input"
  top: "Python27"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 0, \"ty\": -0.8}"
  }
}
layer {
  name: "Concat26"
  type: "Concat"
  bottom: "Concat25"
  bottom: "Python27"
  top: "Concat26"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python28"
  type: "Python"
  bottom: "input"
  top: "Python28"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 0, \"ty\": 0}"
  }
}
layer {
  name: "Concat27"
  type: "Concat"
  bottom: "Concat26"
  bottom: "Python28"
  top: "Concat27"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python29"
  type: "Python"
  bottom: "input"
  top: "Python29"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 0, \"ty\": 0.8}"
  }
}
layer {
  name: "Concat28"
  type: "Concat"
  bottom: "Concat27"
  bottom: "Python29"
  top: "Concat28"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python30"
  type: "Python"
  bottom: "input"
  top: "Python30"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 0, \"ty\": 1.6}"
  }
}
layer {
  name: "Concat29"
  type: "Concat"
  bottom: "Concat28"
  bottom: "Python30"
  top: "Concat29"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python31"
  type: "Python"
  bottom: "input"
  top: "Python31"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 0, \"ty\": 2.4000000000000004}"
  }
}
layer {
  name: "Concat30"
  type: "Concat"
  bottom: "Concat29"
  bottom: "Python31"
  top: "Concat30"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python32"
  type: "Python"
  bottom: "input"
  top: "Python32"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 0, \"ty\": 3.2}"
  }
}
layer {
  name: "Concat31"
  type: "Concat"
  bottom: "Concat30"
  bottom: "Python32"
  top: "Concat31"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python33"
  type: "Python"
  bottom: "input"
  top: "Python33"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 0.8, \"ty\": -2.4000000000000004}"
  }
}
layer {
  name: "Concat32"
  type: "Concat"
  bottom: "Concat31"
  bottom: "Python33"
  top: "Concat32"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python34"
  type: "Python"
  bottom: "input"
  top: "Python34"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 0.8, \"ty\": -1.6}"
  }
}
layer {
  name: "Concat33"
  type: "Concat"
  bottom: "Concat32"
  bottom: "Python34"
  top: "Concat33"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python35"
  type: "Python"
  bottom: "input"
  top: "Python35"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 0.8, \"ty\": -0.8}"
  }
}
layer {
  name: "Concat34"
  type: "Concat"
  bottom: "Concat33"
  bottom: "Python35"
  top: "Concat34"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python36"
  type: "Python"
  bottom: "input"
  top: "Python36"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 0.8, \"ty\": 0}"
  }
}
layer {
  name: "Concat35"
  type: "Concat"
  bottom: "Concat34"
  bottom: "Python36"
  top: "Concat35"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python37"
  type: "Python"
  bottom: "input"
  top: "Python37"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 0.8, \"ty\": 0.8}"
  }
}
layer {
  name: "Concat36"
  type: "Concat"
  bottom: "Concat35"
  bottom: "Python37"
  top: "Concat36"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python38"
  type: "Python"
  bottom: "input"
  top: "Python38"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 0.8, \"ty\": 1.6}"
  }
}
layer {
  name: "Concat37"
  type: "Concat"
  bottom: "Concat36"
  bottom: "Python38"
  top: "Concat37"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python39"
  type: "Python"
  bottom: "input"
  top: "Python39"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 0.8, \"ty\": 2.4000000000000004}"
  }
}
layer {
  name: "Concat38"
  type: "Concat"
  bottom: "Concat37"
  bottom: "Python39"
  top: "Concat38"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python40"
  type: "Python"
  bottom: "input"
  top: "Python40"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 0.8, \"ty\": 3.2}"
  }
}
layer {
  name: "Concat39"
  type: "Concat"
  bottom: "Concat38"
  bottom: "Python40"
  top: "Concat39"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python41"
  type: "Python"
  bottom: "input"
  top: "Python41"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 1.6, \"ty\": -2.4000000000000004}"
  }
}
layer {
  name: "Concat40"
  type: "Concat"
  bottom: "Concat39"
  bottom: "Python41"
  top: "Concat40"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python42"
  type: "Python"
  bottom: "input"
  top: "Python42"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 1.6, \"ty\": -1.6}"
  }
}
layer {
  name: "Concat41"
  type: "Concat"
  bottom: "Concat40"
  bottom: "Python42"
  top: "Concat41"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python43"
  type: "Python"
  bottom: "input"
  top: "Python43"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 1.6, \"ty\": -0.8}"
  }
}
layer {
  name: "Concat42"
  type: "Concat"
  bottom: "Concat41"
  bottom: "Python43"
  top: "Concat42"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python44"
  type: "Python"
  bottom: "input"
  top: "Python44"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 1.6, \"ty\": 0}"
  }
}
layer {
  name: "Concat43"
  type: "Concat"
  bottom: "Concat42"
  bottom: "Python44"
  top: "Concat43"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python45"
  type: "Python"
  bottom: "input"
  top: "Python45"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 1.6, \"ty\": 0.8}"
  }
}
layer {
  name: "Concat44"
  type: "Concat"
  bottom: "Concat43"
  bottom: "Python45"
  top: "Concat44"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python46"
  type: "Python"
  bottom: "input"
  top: "Python46"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 1.6, \"ty\": 1.6}"
  }
}
layer {
  name: "Concat45"
  type: "Concat"
  bottom: "Concat44"
  bottom: "Python46"
  top: "Concat45"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python47"
  type: "Python"
  bottom: "input"
  top: "Python47"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 1.6, \"ty\": 2.4000000000000004}"
  }
}
layer {
  name: "Concat46"
  type: "Concat"
  bottom: "Concat45"
  bottom: "Python47"
  top: "Concat46"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python48"
  type: "Python"
  bottom: "input"
  top: "Python48"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 1.6, \"ty\": 3.2}"
  }
}
layer {
  name: "Concat47"
  type: "Concat"
  bottom: "Concat46"
  bottom: "Python48"
  top: "Concat47"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python49"
  type: "Python"
  bottom: "input"
  top: "Python49"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 2.4000000000000004, \"ty\": -2.4000000000000004}"
  }
}
layer {
  name: "Concat48"
  type: "Concat"
  bottom: "Concat47"
  bottom: "Python49"
  top: "Concat48"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python50"
  type: "Python"
  bottom: "input"
  top: "Python50"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 2.4000000000000004, \"ty\": -1.6}"
  }
}
layer {
  name: "Concat49"
  type: "Concat"
  bottom: "Concat48"
  bottom: "Python50"
  top: "Concat49"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python51"
  type: "Python"
  bottom: "input"
  top: "Python51"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 2.4000000000000004, \"ty\": -0.8}"
  }
}
layer {
  name: "Concat50"
  type: "Concat"
  bottom: "Concat49"
  bottom: "Python51"
  top: "Concat50"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python52"
  type: "Python"
  bottom: "input"
  top: "Python52"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 2.4000000000000004, \"ty\": 0}"
  }
}
layer {
  name: "Concat51"
  type: "Concat"
  bottom: "Concat50"
  bottom: "Python52"
  top: "Concat51"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python53"
  type: "Python"
  bottom: "input"
  top: "Python53"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 2.4000000000000004, \"ty\": 0.8}"
  }
}
layer {
  name: "Concat52"
  type: "Concat"
  bottom: "Concat51"
  bottom: "Python53"
  top: "Concat52"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python54"
  type: "Python"
  bottom: "input"
  top: "Python54"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 2.4000000000000004, \"ty\": 1.6}"
  }
}
layer {
  name: "Concat53"
  type: "Concat"
  bottom: "Concat52"
  bottom: "Python54"
  top: "Concat53"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python55"
  type: "Python"
  bottom: "input"
  top: "Python55"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 2.4000000000000004, \"ty\": 2.4000000000000004}"
  }
}
layer {
  name: "Concat54"
  type: "Concat"
  bottom: "Concat53"
  bottom: "Python55"
  top: "Concat54"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python56"
  type: "Python"
  bottom: "input"
  top: "Python56"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 2.4000000000000004, \"ty\": 3.2}"
  }
}
layer {
  name: "Concat55"
  type: "Concat"
  bottom: "Concat54"
  bottom: "Python56"
  top: "Concat55"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python57"
  type: "Python"
  bottom: "input"
  top: "Python57"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 3.2, \"ty\": -2.4000000000000004}"
  }
}
layer {
  name: "Concat56"
  type: "Concat"
  bottom: "Concat55"
  bottom: "Python57"
  top: "Concat56"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python58"
  type: "Python"
  bottom: "input"
  top: "Python58"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 3.2, \"ty\": -1.6}"
  }
}
layer {
  name: "Concat57"
  type: "Concat"
  bottom: "Concat56"
  bottom: "Python58"
  top: "Concat57"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python59"
  type: "Python"
  bottom: "input"
  top: "Python59"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 3.2, \"ty\": -0.8}"
  }
}
layer {
  name: "Concat58"
  type: "Concat"
  bottom: "Concat57"
  bottom: "Python59"
  top: "Concat58"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python60"
  type: "Python"
  bottom: "input"
  top: "Python60"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 3.2, \"ty\": 0}"
  }
}
layer {
  name: "Concat59"
  type: "Concat"
  bottom: "Concat58"
  bottom: "Python60"
  top: "Concat59"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python61"
  type: "Python"
  bottom: "input"
  top: "Python61"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 3.2, \"ty\": 0.8}"
  }
}
layer {
  name: "Concat60"
  type: "Concat"
  bottom: "Concat59"
  bottom: "Python61"
  top: "Concat60"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python62"
  type: "Python"
  bottom: "input"
  top: "Python62"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 3.2, \"ty\": 1.6}"
  }
}
layer {
  name: "Concat61"
  type: "Concat"
  bottom: "Concat60"
  bottom: "Python62"
  top: "Concat61"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python63"
  type: "Python"
  bottom: "input"
  top: "Python63"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 3.2, \"ty\": 2.4000000000000004}"
  }
}
layer {
  name: "Concat62"
  type: "Concat"
  bottom: "Concat61"
  bottom: "Python63"
  top: "Concat62"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python64"
  type: "Python"
  bottom: "input"
  top: "Python64"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 3.2, \"ty\": 3.2}"
  }
}
layer {
  name: "Concat63"
  type: "Concat"
  bottom: "Concat62"
  bottom: "Python64"
  top: "Concat63"
  concat_param {
    axis: 1
  }
}
layer {
  name: "DummyData6"
  type: "DummyData"
  top: "DummyData6"
  dummy_data_param {
    shape {
      dim: 1
      dim: 1
      dim: 192
      dim: 192
    }
  }
}
layer {
  name: "shift"
  type: "Crop"
  bottom: "Concat63"
  bottom: "DummyData6"
  top: "shift"
  crop_param {
    axis: 2
    offset: 2
  }
}
layer {
  name: "flow_h"
  type: "Slice"
  bottom: "flow64"
  top: "flow_h"
  top: "flow_v"
  slice_param {
    slice_dim: 1
    slice_point: 64
  }
}
layer {
  name: "Slice1"
  type: "Slice"
  bottom: "shift"
  top: "Slice1"
  top: "Slice2"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice3"
  type: "Slice"
  bottom: "flow_h"
  top: "Slice3"
  top: "Slice4"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice5"
  type: "Slice"
  bottom: "flow_v"
  top: "Slice5"
  top: "Slice6"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Warping1"
  type: "Warping"
  bottom: "Slice1"
  bottom: "Slice3"
  bottom: "Slice5"
  top: "Warping1"
}
layer {
  name: "Slice7"
  type: "Slice"
  bottom: "Slice2"
  top: "Slice7"
  top: "Slice8"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice9"
  type: "Slice"
  bottom: "Slice4"
  top: "Slice9"
  top: "Slice10"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice11"
  type: "Slice"
  bottom: "Slice6"
  top: "Slice11"
  top: "Slice12"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Warping2"
  type: "Warping"
  bottom: "Slice7"
  bottom: "Slice9"
  bottom: "Slice11"
  top: "Warping2"
}
layer {
  name: "Concat64"
  type: "Concat"
  bottom: "Warping1"
  bottom: "Warping2"
  top: "Concat64"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice13"
  type: "Slice"
  bottom: "Slice8"
  top: "Slice13"
  top: "Slice14"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice15"
  type: "Slice"
  bottom: "Slice10"
  top: "Slice15"
  top: "Slice16"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice17"
  type: "Slice"
  bottom: "Slice12"
  top: "Slice17"
  top: "Slice18"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Warping3"
  type: "Warping"
  bottom: "Slice13"
  bottom: "Slice15"
  bottom: "Slice17"
  top: "Warping3"
}
layer {
  name: "Concat65"
  type: "Concat"
  bottom: "Concat64"
  bottom: "Warping3"
  top: "Concat65"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice19"
  type: "Slice"
  bottom: "Slice14"
  top: "Slice19"
  top: "Slice20"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice21"
  type: "Slice"
  bottom: "Slice16"
  top: "Slice21"
  top: "Slice22"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice23"
  type: "Slice"
  bottom: "Slice18"
  top: "Slice23"
  top: "Slice24"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Warping4"
  type: "Warping"
  bottom: "Slice19"
  bottom: "Slice21"
  bottom: "Slice23"
  top: "Warping4"
}
layer {
  name: "Concat66"
  type: "Concat"
  bottom: "Concat65"
  bottom: "Warping4"
  top: "Concat66"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice25"
  type: "Slice"
  bottom: "Slice20"
  top: "Slice25"
  top: "Slice26"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice27"
  type: "Slice"
  bottom: "Slice22"
  top: "Slice27"
  top: "Slice28"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice29"
  type: "Slice"
  bottom: "Slice24"
  top: "Slice29"
  top: "Slice30"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Warping5"
  type: "Warping"
  bottom: "Slice25"
  bottom: "Slice27"
  bottom: "Slice29"
  top: "Warping5"
}
layer {
  name: "Concat67"
  type: "Concat"
  bottom: "Concat66"
  bottom: "Warping5"
  top: "Concat67"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice31"
  type: "Slice"
  bottom: "Slice26"
  top: "Slice31"
  top: "Slice32"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice33"
  type: "Slice"
  bottom: "Slice28"
  top: "Slice33"
  top: "Slice34"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice35"
  type: "Slice"
  bottom: "Slice30"
  top: "Slice35"
  top: "Slice36"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Warping6"
  type: "Warping"
  bottom: "Slice31"
  bottom: "Slice33"
  bottom: "Slice35"
  top: "Warping6"
}
layer {
  name: "Concat68"
  type: "Concat"
  bottom: "Concat67"
  bottom: "Warping6"
  top: "Concat68"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice37"
  type: "Slice"
  bottom: "Slice32"
  top: "Slice37"
  top: "Slice38"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice39"
  type: "Slice"
  bottom: "Slice34"
  top: "Slice39"
  top: "Slice40"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice41"
  type: "Slice"
  bottom: "Slice36"
  top: "Slice41"
  top: "Slice42"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Warping7"
  type: "Warping"
  bottom: "Slice37"
  bottom: "Slice39"
  bottom: "Slice41"
  top: "Warping7"
}
layer {
  name: "Concat69"
  type: "Concat"
  bottom: "Concat68"
  bottom: "Warping7"
  top: "Concat69"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice43"
  type: "Slice"
  bottom: "Slice38"
  top: "Slice43"
  top: "Slice44"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice45"
  type: "Slice"
  bottom: "Slice40"
  top: "Slice45"
  top: "Slice46"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice47"
  type: "Slice"
  bottom: "Slice42"
  top: "Slice47"
  top: "Slice48"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Warping8"
  type: "Warping"
  bottom: "Slice43"
  bottom: "Slice45"
  bottom: "Slice47"
  top: "Warping8"
}
layer {
  name: "Concat70"
  type: "Concat"
  bottom: "Concat69"
  bottom: "Warping8"
  top: "Concat70"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice49"
  type: "Slice"
  bottom: "Slice44"
  top: "Slice49"
  top: "Slice50"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice51"
  type: "Slice"
  bottom: "Slice46"
  top: "Slice51"
  top: "Slice52"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice53"
  type: "Slice"
  bottom: "Slice48"
  top: "Slice53"
  top: "Slice54"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Warping9"
  type: "Warping"
  bottom: "Slice49"
  bottom: "Slice51"
  bottom: "Slice53"
  top: "Warping9"
}
layer {
  name: "Concat71"
  type: "Concat"
  bottom: "Concat70"
  bottom: "Warping9"
  top: "Concat71"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice55"
  type: "Slice"
  bottom: "Slice50"
  top: "Slice55"
  top: "Slice56"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice57"
  type: "Slice"
  bottom: "Slice52"
  top: "Slice57"
  top: "Slice58"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice59"
  type: "Slice"
  bottom: "Slice54"
  top: "Slice59"
  top: "Slice60"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Warping10"
  type: "Warping"
  bottom: "Slice55"
  bottom: "Slice57"
  bottom: "Slice59"
  top: "Warping10"
}
layer {
  name: "Concat72"
  type: "Concat"
  bottom: "Concat71"
  bottom: "Warping10"
  top: "Concat72"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice61"
  type: "Slice"
  bottom: "Slice56"
  top: "Slice61"
  top: "Slice62"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice63"
  type: "Slice"
  bottom: "Slice58"
  top: "Slice63"
  top: "Slice64"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice65"
  type: "Slice"
  bottom: "Slice60"
  top: "Slice65"
  top: "Slice66"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Warping11"
  type: "Warping"
  bottom: "Slice61"
  bottom: "Slice63"
  bottom: "Slice65"
  top: "Warping11"
}
layer {
  name: "Concat73"
  type: "Concat"
  bottom: "Concat72"
  bottom: "Warping11"
  top: "Concat73"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice67"
  type: "Slice"
  bottom: "Slice62"
  top: "Slice67"
  top: "Slice68"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice69"
  type: "Slice"
  bottom: "Slice64"
  top: "Slice69"
  top: "Slice70"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice71"
  type: "Slice"
  bottom: "Slice66"
  top: "Slice71"
  top: "Slice72"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Warping12"
  type: "Warping"
  bottom: "Slice67"
  bottom: "Slice69"
  bottom: "Slice71"
  top: "Warping12"
}
layer {
  name: "Concat74"
  type: "Concat"
  bottom: "Concat73"
  bottom: "Warping12"
  top: "Concat74"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice73"
  type: "Slice"
  bottom: "Slice68"
  top: "Slice73"
  top: "Slice74"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice75"
  type: "Slice"
  bottom: "Slice70"
  top: "Slice75"
  top: "Slice76"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice77"
  type: "Slice"
  bottom: "Slice72"
  top: "Slice77"
  top: "Slice78"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Warping13"
  type: "Warping"
  bottom: "Slice73"
  bottom: "Slice75"
  bottom: "Slice77"
  top: "Warping13"
}
layer {
  name: "Concat75"
  type: "Concat"
  bottom: "Concat74"
  bottom: "Warping13"
  top: "Concat75"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice79"
  type: "Slice"
  bottom: "Slice74"
  top: "Slice79"
  top: "Slice80"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice81"
  type: "Slice"
  bottom: "Slice76"
  top: "Slice81"
  top: "Slice82"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice83"
  type: "Slice"
  bottom: "Slice78"
  top: "Slice83"
  top: "Slice84"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Warping14"
  type: "Warping"
  bottom: "Slice79"
  bottom: "Slice81"
  bottom: "Slice83"
  top: "Warping14"
}
layer {
  name: "Concat76"
  type: "Concat"
  bottom: "Concat75"
  bottom: "Warping14"
  top: "Concat76"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice85"
  type: "Slice"
  bottom: "Slice80"
  top: "Slice85"
  top: "Slice86"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice87"
  type: "Slice"
  bottom: "Slice82"
