layer {
  name: "input"
  type: "ImageData"
  top: "input"
  top: "ImageData1"
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "./datas/face_dataset/face_test_9x9/test_source12.txt"
    batch_size: 1
    shuffle: false
    new_height: 256
    new_width: 256
    is_color: false
  }
}
layer {
  name: "ImageData2"
  type: "ImageData"
  top: "ImageData2"
  top: "ImageData3"
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "./datas/face_dataset/face_test_9x9/test_source0.txt"
    batch_size: 1
    shuffle: false
    new_height: 256
    new_width: 256
    is_color: false
  }
}
layer {
  name: "ImageData4"
  type: "ImageData"
  top: "ImageData4"
  top: "ImageData5"
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "./datas/face_dataset/face_test_9x9/test_source1.txt"
    batch_size: 1
    shuffle: false
    new_height: 256
    new_width: 256
    is_color: false
  }
}
layer {
  name: "Concat1"
  type: "Concat"
  bottom: "ImageData2"
  bottom: "ImageData4"
  top: "Concat1"
  concat_param {
    axis: 1
  }
}
layer {
  name: "ImageData6"
  type: "ImageData"
  top: "ImageData6"
  top: "ImageData7"
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "./datas/face_dataset/face_test_9x9/test_source2.txt"
    batch_size: 1
    shuffle: false
    new_height: 256
    new_width: 256
    is_color: false
  }
}
layer {
  name: "Concat2"
  type: "Concat"
  bottom: "Concat1"
  bottom: "ImageData6"
  top: "Concat2"
  concat_param {
    axis: 1
  }
}
layer {
  name: "ImageData8"
  type: "ImageData"
  top: "ImageData8"
  top: "ImageData9"
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "./datas/face_dataset/face_test_9x9/test_source3.txt"
    batch_size: 1
    shuffle: false
    new_height: 256
    new_width: 256
    is_color: false
  }
}
layer {
  name: "Concat3"
  type: "Concat"
  bottom: "Concat2"
  bottom: "ImageData8"
  top: "Concat3"
  concat_param {
    axis: 1
  }
}
layer {
  name: "ImageData10"
  type: "ImageData"
  top: "ImageData10"
  top: "ImageData11"
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "./datas/face_dataset/face_test_9x9/test_source4.txt"
    batch_size: 1
    shuffle: false
    new_height: 256
    new_width: 256
    is_color: false
  }
}
layer {
  name: "Concat4"
  type: "Concat"
  bottom: "Concat3"
  bottom: "ImageData10"
  top: "Concat4"
  concat_param {
    axis: 1
  }
}
layer {
  name: "ImageData12"
  type: "ImageData"
  top: "ImageData12"
  top: "ImageData13"
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "./datas/face_dataset/face_test_9x9/test_source5.txt"
    batch_size: 1
    shuffle: false
    new_height: 256
    new_width: 256
    is_color: false
  }
}
layer {
  name: "Concat5"
  type: "Concat"
  bottom: "Concat4"
  bottom: "ImageData12"
  top: "Concat5"
  concat_param {
    axis: 1
  }
}
layer {
  name: "ImageData14"
  type: "ImageData"
  top: "ImageData14"
  top: "ImageData15"
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "./datas/face_dataset/face_test_9x9/test_source6.txt"
    batch_size: 1
    shuffle: false
    new_height: 256
    new_width: 256
    is_color: false
  }
}
layer {
  name: "Concat6"
  type: "Concat"
  bottom: "Concat5"
  bottom: "ImageData14"
  top: "Concat6"
  concat_param {
    axis: 1
  }
}
layer {
  name: "ImageData16"
  type: "ImageData"
  top: "ImageData16"
  top: "ImageData17"
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "./datas/face_dataset/face_test_9x9/test_source7.txt"
    batch_size: 1
    shuffle: false
    new_height: 256
    new_width: 256
    is_color: false
  }
}
layer {
  name: "Concat7"
  type: "Concat"
  bottom: "Concat6"
  bottom: "ImageData16"
  top: "Concat7"
  concat_param {
    axis: 1
  }
}
layer {
  name: "ImageData18"
  type: "ImageData"
  top: "ImageData18"
  top: "ImageData19"
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "./datas/face_dataset/face_test_9x9/test_source8.txt"
    batch_size: 1
    shuffle: false
    new_height: 256
    new_width: 256
    is_color: false
  }
}
layer {
  name: "Concat8"
  type: "Concat"
  bottom: "Concat7"
  bottom: "ImageData18"
  top: "Concat8"
  concat_param {
    axis: 1
  }
}
layer {
  name: "ImageData20"
  type: "ImageData"
  top: "ImageData20"
  top: "ImageData21"
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "./datas/face_dataset/face_test_9x9/test_source9.txt"
    batch_size: 1
    shuffle: false
    new_height: 256
    new_width: 256
    is_color: false
  }
}
layer {
  name: "Concat9"
  type: "Concat"
  bottom: "Concat8"
  bottom: "ImageData20"
  top: "Concat9"
  concat_param {
    axis: 1
  }
}
layer {
  name: "ImageData22"
  type: "ImageData"
  top: "ImageData22"
  top: "ImageData23"
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "./datas/face_dataset/face_test_9x9/test_source10.txt"
    batch_size: 1
    shuffle: false
    new_height: 256
    new_width: 256
    is_color: false
  }
}
layer {
  name: "Concat10"
  type: "Concat"
  bottom: "Concat9"
  bottom: "ImageData22"
  top: "Concat10"
  concat_param {
    axis: 1
  }
}
layer {
  name: "ImageData24"
  type: "ImageData"
  top: "ImageData24"
  top: "ImageData25"
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "./datas/face_dataset/face_test_9x9/test_source11.txt"
    batch_size: 1
    shuffle: false
    new_height: 256
    new_width: 256
    is_color: false
  }
}
layer {
  name: "Concat11"
  type: "Concat"
  bottom: "Concat10"
  bottom: "ImageData24"
  top: "Concat11"
  concat_param {
    axis: 1
  }
}
layer {
  name: "ImageData26"
  type: "ImageData"
  top: "ImageData26"
  top: "ImageData27"
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "./datas/face_dataset/face_test_9x9/test_source12.txt"
    batch_size: 1
    shuffle: false
    new_height: 256
    new_width: 256
    is_color: false
  }
}
layer {
  name: "Concat12"
  type: "Concat"
  bottom: "Concat11"
  bottom: "ImageData26"
  top: "Concat12"
  concat_param {
    axis: 1
  }
}
layer {
  name: "ImageData28"
  type: "ImageData"
  top: "ImageData28"
  top: "ImageData29"
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "./datas/face_dataset/face_test_9x9/test_source13.txt"
    batch_size: 1
    shuffle: false
    new_height: 256
    new_width: 256
    is_color: false
  }
}
layer {
  name: "Concat13"
  type: "Concat"
  bottom: "Concat12"
  bottom: "ImageData28"
  top: "Concat13"
  concat_param {
    axis: 1
  }
}
layer {
  name: "ImageData30"
  type: "ImageData"
  top: "ImageData30"
  top: "ImageData31"
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "./datas/face_dataset/face_test_9x9/test_source14.txt"
    batch_size: 1
    shuffle: false
    new_height: 256
    new_width: 256
    is_color: false
  }
}
layer {
  name: "Concat14"
  type: "Concat"
  bottom: "Concat13"
  bottom: "ImageData30"
  top: "Concat14"
  concat_param {
    axis: 1
  }
}
layer {
  name: "ImageData32"
  type: "ImageData"
  top: "ImageData32"
  top: "ImageData33"
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "./datas/face_dataset/face_test_9x9/test_source15.txt"
    batch_size: 1
    shuffle: false
    new_height: 256
    new_width: 256
    is_color: false
  }
}
layer {
  name: "Concat15"
  type: "Concat"
  bottom: "Concat14"
  bottom: "ImageData32"
  top: "Concat15"
  concat_param {
    axis: 1
  }
}
layer {
  name: "ImageData34"
  type: "ImageData"
  top: "ImageData34"
  top: "ImageData35"
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "./datas/face_dataset/face_test_9x9/test_source16.txt"
    batch_size: 1
    shuffle: false
    new_height: 256
    new_width: 256
    is_color: false
  }
}
layer {
  name: "Concat16"
  type: "Concat"
  bottom: "Concat15"
  bottom: "ImageData34"
  top: "Concat16"
  concat_param {
    axis: 1
  }
}
layer {
  name: "ImageData36"
  type: "ImageData"
  top: "ImageData36"
  top: "ImageData37"
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "./datas/face_dataset/face_test_9x9/test_source17.txt"
    batch_size: 1
    shuffle: false
    new_height: 256
    new_width: 256
    is_color: false
  }
}
layer {
  name: "Concat17"
  type: "Concat"
  bottom: "Concat16"
  bottom: "ImageData36"
  top: "Concat17"
  concat_param {
    axis: 1
  }
}
layer {
  name: "ImageData38"
  type: "ImageData"
  top: "ImageData38"
  top: "ImageData39"
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "./datas/face_dataset/face_test_9x9/test_source18.txt"
    batch_size: 1
    shuffle: false
    new_height: 256
    new_width: 256
    is_color: false
  }
}
layer {
  name: "Concat18"
  type: "Concat"
  bottom: "Concat17"
  bottom: "ImageData38"
  top: "Concat18"
  concat_param {
    axis: 1
  }
}
layer {
  name: "ImageData40"
  type: "ImageData"
  top: "ImageData40"
  top: "ImageData41"
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "./datas/face_dataset/face_test_9x9/test_source19.txt"
    batch_size: 1
    shuffle: false
    new_height: 256
    new_width: 256
    is_color: false
  }
}
layer {
  name: "Concat19"
  type: "Concat"
  bottom: "Concat18"
  bottom: "ImageData40"
  top: "Concat19"
  concat_param {
    axis: 1
  }
}
layer {
  name: "ImageData42"
  type: "ImageData"
  top: "ImageData42"
  top: "ImageData43"
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "./datas/face_dataset/face_test_9x9/test_source20.txt"
    batch_size: 1
    shuffle: false
    new_height: 256
    new_width: 256
    is_color: false
  }
}
layer {
  name: "Concat20"
  type: "Concat"
  bottom: "Concat19"
  bottom: "ImageData42"
  top: "Concat20"
  concat_param {
    axis: 1
  }
}
layer {
  name: "ImageData44"
  type: "ImageData"
  top: "ImageData44"
  top: "ImageData45"
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "./datas/face_dataset/face_test_9x9/test_source21.txt"
    batch_size: 1
    shuffle: false
    new_height: 256
    new_width: 256
    is_color: false
  }
}
layer {
  name: "Concat21"
  type: "Concat"
  bottom: "Concat20"
  bottom: "ImageData44"
  top: "Concat21"
  concat_param {
    axis: 1
  }
}
layer {
  name: "ImageData46"
  type: "ImageData"
  top: "ImageData46"
  top: "ImageData47"
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "./datas/face_dataset/face_test_9x9/test_source22.txt"
    batch_size: 1
    shuffle: false
    new_height: 256
    new_width: 256
    is_color: false
  }
}
layer {
  name: "Concat22"
  type: "Concat"
  bottom: "Concat21"
  bottom: "ImageData46"
  top: "Concat22"
  concat_param {
    axis: 1
  }
}
layer {
  name: "ImageData48"
  type: "ImageData"
  top: "ImageData48"
  top: "ImageData49"
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "./datas/face_dataset/face_test_9x9/test_source23.txt"
    batch_size: 1
    shuffle: false
    new_height: 256
    new_width: 256
    is_color: false
  }
}
layer {
  name: "Concat23"
  type: "Concat"
  bottom: "Concat22"
  bottom: "ImageData48"
  top: "Concat23"
  concat_param {
    axis: 1
  }
}
layer {
  name: "ImageData50"
  type: "ImageData"
  top: "ImageData50"
  top: "ImageData51"
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "./datas/face_dataset/face_test_9x9/test_source24.txt"
    batch_size: 1
    shuffle: false
    new_height: 256
    new_width: 256
    is_color: false
  }
}
layer {
  name: "label"
  type: "Concat"
  bottom: "Concat23"
  bottom: "ImageData50"
  top: "label"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Convolution1"
  type: "Convolution"
  bottom: "input"
  top: "Convolution1"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU1"
  type: "ReLU"
  bottom: "Convolution1"
  top: "Convolution1"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution2"
  type: "Convolution"
  bottom: "Convolution1"
  top: "Convolution2"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 16
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "Convolution3"
  type: "Convolution"
  bottom: "Convolution2"
  top: "Convolution3"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU2"
  type: "ReLU"
  bottom: "Convolution3"
  top: "Convolution3"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Pooling1"
  type: "Pooling"
  bottom: "Convolution3"
  top: "Pooling1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU3"
  type: "ReLU"
  bottom: "Pooling1"
  top: "Pooling1"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution4"
  type: "Convolution"
  bottom: "Pooling1"
  top: "Convolution4"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU4"
  type: "ReLU"
  bottom: "Convolution4"
  top: "Convolution4"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution5"
  type: "Convolution"
  bottom: "Convolution4"
  top: "Convolution5"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 32
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "Convolution6"
  type: "Convolution"
  bottom: "Convolution5"
  top: "Convolution6"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU5"
  type: "ReLU"
  bottom: "Convolution6"
  top: "Convolution6"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Pooling2"
  type: "Pooling"
  bottom: "Convolution6"
  top: "Pooling2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU6"
  type: "ReLU"
  bottom: "Pooling2"
  top: "Pooling2"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution7"
  type: "Convolution"
  bottom: "Pooling2"
  top: "Convolution7"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU7"
  type: "ReLU"
  bottom: "Convolution7"
  top: "Convolution7"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution8"
  type: "Convolution"
  bottom: "Convolution7"
  top: "Convolution8"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 64
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "Convolution9"
  type: "Convolution"
  bottom: "Convolution8"
  top: "Convolution9"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU8"
  type: "ReLU"
  bottom: "Convolution9"
  top: "Convolution9"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Pooling3"
  type: "Pooling"
  bottom: "Convolution9"
  top: "Pooling3"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU9"
  type: "ReLU"
  bottom: "Pooling3"
  top: "Pooling3"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution10"
  type: "Convolution"
  bottom: "Pooling3"
  top: "Convolution10"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU10"
  type: "ReLU"
  bottom: "Convolution10"
  top: "Convolution10"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution11"
  type: "Convolution"
  bottom: "Convolution10"
  top: "Convolution11"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 128
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "Convolution12"
  type: "Convolution"
  bottom: "Convolution11"
  top: "Convolution12"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU11"
  type: "ReLU"
  bottom: "Convolution12"
  top: "Convolution12"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Pooling4"
  type: "Pooling"
  bottom: "Convolution12"
  top: "Pooling4"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU12"
  type: "ReLU"
  bottom: "Pooling4"
  top: "Pooling4"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution13"
  type: "Convolution"
  bottom: "Pooling4"
  top: "Convolution13"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU13"
  type: "ReLU"
  bottom: "Convolution13"
  top: "Convolution13"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution14"
  type: "Convolution"
  bottom: "Convolution13"
  top: "Convolution14"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 256
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "Convolution15"
  type: "Convolution"
  bottom: "Convolution14"
  top: "Convolution15"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU14"
  type: "ReLU"
  bottom: "Convolution15"
  top: "Convolution15"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Pooling5"
  type: "Pooling"
  bottom: "Convolution15"
  top: "Pooling5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU15"
  type: "ReLU"
  bottom: "Pooling5"
  top: "Pooling5"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution16"
  type: "Convolution"
  bottom: "Pooling5"
  top: "Convolution16"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU16"
  type: "ReLU"
  bottom: "Convolution16"
  top: "Convolution16"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution17"
  type: "Convolution"
  bottom: "Convolution16"
  top: "Convolution17"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 3
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 3
  }
}
layer {
  name: "ReLU17"
  type: "ReLU"
  bottom: "Convolution17"
  top: "Convolution17"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution18"
  type: "Convolution"
  bottom: "Convolution17"
  top: "Convolution18"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 6
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 6
  }
}
layer {
  name: "Eltwise1"
  type: "Eltwise"
  bottom: "Convolution18"
  bottom: "Convolution16"
  top: "Eltwise1"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "ReLU18"
  type: "ReLU"
  bottom: "Eltwise1"
  top: "Eltwise1"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Deconvolution1"
  type: "Deconvolution"
  bottom: "Eltwise1"
  top: "Deconvolution1"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU19"
  type: "ReLU"
  bottom: "Deconvolution1"
  top: "Deconvolution1"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "DummyData1"
  type: "DummyData"
  top: "DummyData1"
  dummy_data_param {
    shape {
      dim: 1
      dim: 256
      dim: 16
      dim: 16
    }
  }
}
layer {
  name: "Crop1"
  type: "Crop"
  bottom: "Deconvolution1"
  bottom: "DummyData1"
  top: "Crop1"
  crop_param {
    axis: 1
    offset: 0
    offset: 0
    offset: 0
  }
}
layer {
  name: "Concat24"
  type: "Concat"
  bottom: "Crop1"
  bottom: "Convolution15"
  top: "Concat24"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Convolution19"
  type: "Convolution"
  bottom: "Concat24"
  top: "Convolution19"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU20"
  type: "ReLU"
  bottom: "Convolution19"
  top: "Convolution19"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution20"
  type: "Convolution"
  bottom: "Convolution19"
  top: "Convolution20"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 256
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "Convolution21"
  type: "Convolution"
  bottom: "Convolution20"
  top: "Convolution21"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU21"
  type: "ReLU"
  bottom: "Convolution21"
  top: "Convolution21"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Deconvolution2"
  type: "Deconvolution"
  bottom: "Convolution21"
  top: "Deconvolution2"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU22"
  type: "ReLU"
  bottom: "Deconvolution2"
  top: "Deconvolution2"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "DummyData2"
  type: "DummyData"
  top: "DummyData2"
  dummy_data_param {
    shape {
      dim: 1
      dim: 128
      dim: 32
      dim: 32
    }
  }
}
layer {
  name: "Crop2"
  type: "Crop"
  bottom: "Deconvolution2"
  bottom: "DummyData2"
  top: "Crop2"
  crop_param {
    axis: 1
    offset: 0
    offset: 0
    offset: 0
  }
}
layer {
  name: "Concat25"
  type: "Concat"
  bottom: "Crop2"
  bottom: "Convolution12"
  top: "Concat25"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Convolution22"
  type: "Convolution"
  bottom: "Concat25"
  top: "Convolution22"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU23"
  type: "ReLU"
  bottom: "Convolution22"
  top: "Convolution22"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution23"
  type: "Convolution"
  bottom: "Convolution22"
  top: "Convolution23"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 128
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "Convolution24"
  type: "Convolution"
  bottom: "Convolution23"
  top: "Convolution24"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU24"
  type: "ReLU"
  bottom: "Convolution24"
  top: "Convolution24"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Deconvolution3"
  type: "Deconvolution"
  bottom: "Convolution24"
  top: "Deconvolution3"
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU25"
  type: "ReLU"
  bottom: "Deconvolution3"
  top: "Deconvolution3"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "DummyData3"
  type: "DummyData"
  top: "DummyData3"
  dummy_data_param {
    shape {
      dim: 1
      dim: 64
      dim: 64
      dim: 64
    }
  }
}
layer {
  name: "Crop3"
  type: "Crop"
  bottom: "Deconvolution3"
  bottom: "DummyData3"
  top: "Crop3"
  crop_param {
    axis: 1
    offset: 0
    offset: 0
    offset: 0
  }
}
layer {
  name: "Concat26"
  type: "Concat"
  bottom: "Crop3"
  bottom: "Convolution9"
  top: "Concat26"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Convolution25"
  type: "Convolution"
  bottom: "Concat26"
  top: "Convolution25"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU26"
  type: "ReLU"
  bottom: "Convolution25"
  top: "Convolution25"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution26"
  type: "Convolution"
  bottom: "Convolution25"
  top: "Convolution26"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 64
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "Convolution27"
  type: "Convolution"
  bottom: "Convolution26"
  top: "Convolution27"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU27"
  type: "ReLU"
  bottom: "Convolution27"
  top: "Convolution27"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Deconvolution4"
  type: "Deconvolution"
  bottom: "Convolution27"
  top: "Deconvolution4"
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU28"
  type: "ReLU"
  bottom: "Deconvolution4"
  top: "Deconvolution4"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "DummyData4"
  type: "DummyData"
  top: "DummyData4"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 128
      dim: 128
    }
  }
}
layer {
  name: "Crop4"
  type: "Crop"
  bottom: "Deconvolution4"
  bottom: "DummyData4"
  top: "Crop4"
  crop_param {
    axis: 1
    offset: 0
    offset: 0
    offset: 0
  }
}
layer {
  name: "Concat27"
  type: "Concat"
  bottom: "Crop4"
  bottom: "Convolution6"
  top: "Concat27"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Convolution28"
  type: "Convolution"
  bottom: "Concat27"
  top: "Convolution28"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU29"
  type: "ReLU"
  bottom: "Convolution28"
  top: "Convolution28"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution29"
  type: "Convolution"
  bottom: "Convolution28"
  top: "Convolution29"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 32
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "Convolution30"
  type: "Convolution"
  bottom: "Convolution29"
  top: "Convolution30"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU30"
  type: "ReLU"
  bottom: "Convolution30"
  top: "Convolution30"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Deconvolution5"
  type: "Deconvolution"
  bottom: "Convolution30"
  top: "Deconvolution5"
  convolution_param {
    num_output: 16
    pad: 0
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU31"
  type: "ReLU"
  bottom: "Deconvolution5"
  top: "Deconvolution5"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "DummyData5"
  type: "DummyData"
  top: "DummyData5"
  dummy_data_param {
    shape {
      dim: 1
      dim: 16
      dim: 256
      dim: 256
    }
  }
}
layer {
  name: "Crop5"
  type: "Crop"
  bottom: "Deconvolution5"
  bottom: "DummyData5"
  top: "Crop5"
  crop_param {
    axis: 1
    offset: 0
    offset: 0
    offset: 0
  }
}
layer {
  name: "Concat28"
  type: "Concat"
  bottom: "Crop5"
  bottom: "Convolution3"
  top: "Concat28"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Convolution31"
  type: "Convolution"
  bottom: "Concat28"
  top: "Convolution31"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU32"
  type: "ReLU"
  bottom: "Convolution31"
  top: "Convolution31"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution32"
  type: "Convolution"
  bottom: "Convolution31"
  top: "Convolution32"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 16
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "Convolution33"
  type: "Convolution"
  bottom: "Convolution32"
  top: "Convolution33"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU33"
  type: "ReLU"
  bottom: "Convolution33"
  top: "Convolution33"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "ReLU34"
  type: "ReLU"
  bottom: "Convolution33"
  top: "Convolution33"
  relu_param {
    engine: CAFFE
  }
}
layer {
  name: "flow_init"
  type: "Convolution"
  bottom: "Convolution33"
  top: "flow_init"
  convolution_param {
    num_output: 1
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "flow"
  type: "Convolution"
  bottom: "flow_init"
  top: "flow"
  convolution_param {
    num_output: 50
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "Python1"
  type: "Python"
  bottom: "input"
  top: "Python1"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -1.5525, \"ty\": -1.5525}"
  }
}
layer {
  name: "Python2"
  type: "Python"
  bottom: "input"
  top: "Python2"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -1.5525, \"ty\": -0.77625}"
  }
}
layer {
  name: "Concat29"
  type: "Concat"
  bottom: "Python1"
  bottom: "Python2"
  top: "Concat29"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python3"
  type: "Python"
  bottom: "input"
  top: "Python3"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -1.5525, \"ty\": 0}"
  }
}
layer {
  name: "Concat30"
  type: "Concat"
  bottom: "Concat29"
  bottom: "Python3"
  top: "Concat30"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python4"
  type: "Python"
  bottom: "input"
  top: "Python4"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -1.5525, \"ty\": 0.77625}"
  }
}
layer {
  name: "Concat31"
  type: "Concat"
  bottom: "Concat30"
  bottom: "Python4"
  top: "Concat31"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python5"
  type: "Python"
  bottom: "input"
  top: "Python5"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -1.5525, \"ty\": 1.5525}"
  }
}
layer {
  name: "Concat32"
  type: "Concat"
  bottom: "Concat31"
  bottom: "Python5"
  top: "Concat32"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python6"
  type: "Python"
  bottom: "input"
  top: "Python6"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -0.77625, \"ty\": -1.5525}"
  }
}
layer {
  name: "Concat33"
  type: "Concat"
  bottom: "Concat32"
  bottom: "Python6"
  top: "Concat33"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python7"
  type: "Python"
  bottom: "input"
  top: "Python7"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -0.77625, \"ty\": -0.77625}"
  }
}
layer {
  name: "Concat34"
  type: "Concat"
  bottom: "Concat33"
  bottom: "Python7"
  top: "Concat34"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python8"
  type: "Python"
  bottom: "input"
  top: "Python8"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -0.77625, \"ty\": 0}"
  }
}
layer {
  name: "Concat35"
  type: "Concat"
  bottom: "Concat34"
  bottom: "Python8"
  top: "Concat35"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python9"
  type: "Python"
  bottom: "input"
  top: "Python9"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -0.77625, \"ty\": 0.77625}"
  }
}
layer {
  name: "Concat36"
  type: "Concat"
  bottom: "Concat35"
  bottom: "Python9"
  top: "Concat36"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python10"
  type: "Python"
  bottom: "input"
  top: "Python10"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": -0.77625, \"ty\": 1.5525}"
  }
}
layer {
  name: "Concat37"
  type: "Concat"
  bottom: "Concat36"
  bottom: "Python10"
  top: "Concat37"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python11"
  type: "Python"
  bottom: "input"
  top: "Python11"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 0, \"ty\": -1.5525}"
  }
}
layer {
  name: "Concat38"
  type: "Concat"
  bottom: "Concat37"
  bottom: "Python11"
  top: "Concat38"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python12"
  type: "Python"
  bottom: "input"
  top: "Python12"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 0, \"ty\": -0.77625}"
  }
}
layer {
  name: "Concat39"
  type: "Concat"
  bottom: "Concat38"
  bottom: "Python12"
  top: "Concat39"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python13"
  type: "Python"
  bottom: "input"
  top: "Python13"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 0, \"ty\": 0}"
  }
}
layer {
  name: "Concat40"
  type: "Concat"
  bottom: "Concat39"
  bottom: "Python13"
  top: "Concat40"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python14"
  type: "Python"
  bottom: "input"
  top: "Python14"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 0, \"ty\": 0.77625}"
  }
}
layer {
  name: "Concat41"
  type: "Concat"
  bottom: "Concat40"
  bottom: "Python14"
  top: "Concat41"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python15"
  type: "Python"
  bottom: "input"
  top: "Python15"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 0, \"ty\": 1.5525}"
  }
}
layer {
  name: "Concat42"
  type: "Concat"
  bottom: "Concat41"
  bottom: "Python15"
  top: "Concat42"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python16"
  type: "Python"
  bottom: "input"
  top: "Python16"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 0.77625, \"ty\": -1.5525}"
  }
}
layer {
  name: "Concat43"
  type: "Concat"
  bottom: "Concat42"
  bottom: "Python16"
  top: "Concat43"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python17"
  type: "Python"
  bottom: "input"
  top: "Python17"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 0.77625, \"ty\": -0.77625}"
  }
}
layer {
  name: "Concat44"
  type: "Concat"
  bottom: "Concat43"
  bottom: "Python17"
  top: "Concat44"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python18"
  type: "Python"
  bottom: "input"
  top: "Python18"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 0.77625, \"ty\": 0}"
  }
}
layer {
  name: "Concat45"
  type: "Concat"
  bottom: "Concat44"
  bottom: "Python18"
  top: "Concat45"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python19"
  type: "Python"
  bottom: "input"
  top: "Python19"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 0.77625, \"ty\": 0.77625}"
  }
}
layer {
  name: "Concat46"
  type: "Concat"
  bottom: "Concat45"
  bottom: "Python19"
  top: "Concat46"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python20"
  type: "Python"
  bottom: "input"
  top: "Python20"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 0.77625, \"ty\": 1.5525}"
  }
}
layer {
  name: "Concat47"
  type: "Concat"
  bottom: "Concat46"
  bottom: "Python20"
  top: "Concat47"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python21"
  type: "Python"
  bottom: "input"
  top: "Python21"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 1.5525, \"ty\": -1.5525}"
  }
}
layer {
  name: "Concat48"
  type: "Concat"
  bottom: "Concat47"
  bottom: "Python21"
  top: "Concat48"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python22"
  type: "Python"
  bottom: "input"
  top: "Python22"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 1.5525, \"ty\": -0.77625}"
  }
}
layer {
  name: "Concat49"
  type: "Concat"
  bottom: "Concat48"
  bottom: "Python22"
  top: "Concat49"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python23"
  type: "Python"
  bottom: "input"
  top: "Python23"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 1.5525, \"ty\": 0}"
  }
}
layer {
  name: "Concat50"
  type: "Concat"
  bottom: "Concat49"
  bottom: "Python23"
  top: "Concat50"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python24"
  type: "Python"
  bottom: "input"
  top: "Python24"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 1.5525, \"ty\": 0.77625}"
  }
}
layer {
  name: "Concat51"
  type: "Concat"
  bottom: "Concat50"
  bottom: "Python24"
  top: "Concat51"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python25"
  type: "Python"
  bottom: "input"
  top: "Python25"
  python_param {
    module: "input_shifting_layer"
    layer: "InputShiftingLayer"
    param_str: "{\"tx\": 1.5525, \"ty\": 1.5525}"
  }
}
layer {
  name: "shift"
  type: "Concat"
  bottom: "Concat51"
  bottom: "Python25"
  top: "shift"
  concat_param {
    axis: 1
  }
}
layer {
  name: "flow_h"
  type: "Slice"
  bottom: "flow"
  top: "flow_h"
  top: "flow_v"
  slice_param {
    slice_dim: 1
    slice_point: 25
  }
}
layer {
  name: "flow_con"
  type: "Concat"
  bottom: "flow_v"
  bottom: "flow_h"
  top: "flow_con"
  concat_param {
    axis: 1
  }
}
layer {
  name: "predict"
  type: "Python"
  bottom: "shift"
  bottom: "flow_con"
  top: "predict"
  python_param {
    module: "bilinear_sampler_layer_3ch"
    layer: "BilinearSamplerLayer3ch"
    param_str: "{\"flow_size\": 25, \"color_size\": 1}"
  }
}
layer {
  name: "depth_predict"
  type: "Convolution"
  bottom: "flow_init"
  top: "depth_predict"
  convolution_param {
    num_output: 1
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "DummyData6"
  type: "DummyData"
  top: "DummyData6"
  dummy_data_param {
    shape {
      dim: 1
      dim: 1
      dim: 256
      dim: 256
    }
  }
}
layer {
  name: "Crop6"
  type: "Crop"
  bottom: "label"
  bottom: "DummyData6"
  top: "Crop6"
  crop_param {
    axis: 1
    offset: 0
    offset: 0
    offset: 0
  }
}
layer {
  name: "DummyData7"
  type: "DummyData"
  top: "DummyData7"
  dummy_data_param {
    shape {
      dim: 1
      dim: 1
      dim: 256
      dim: 256
    }
  }
}
layer {
  name: "Crop7"
  type: "Crop"
  bottom: "label"
  bottom: "DummyData7"
  top: "Crop7"
  crop_param {
    axis: 1
    offset: 5
    offset: 0
    offset: 0
  }
}
layer {
  name: "Concat52"
  type: "Concat"
  bottom: "Crop6"
  bottom: "Crop7"
  top: "Concat52"
  concat_param {
    axis: 1
  }
}
layer {
  name: "DummyData8"
  type: "DummyData"
  top: "DummyData8"
  dummy_data_param {
    shape {
      dim: 1
      dim: 1
      dim: 256
      dim: 256
    }
  }
}
layer {
  name: "Crop8"
  type: "Crop"
  bottom: "label"
  bottom: "DummyData8"
  top: "Crop8"
  crop_param {
    axis: 1
    offset: 10
    offset: 0
    offset: 0
  }
}
layer {
  name: "Concat53"
  type: "Concat"
  bottom: "Concat52"
  bottom: "Crop8"
  top: "Concat53"
  concat_param {
    axis: 1
  }
}
layer {
  name: "DummyData9"
  type: "DummyData"
  top: "DummyData9"
  dummy_data_param {
    shape {
      dim: 1
      dim: 1
      dim: 256
      dim: 256
    }
  }
}
layer {
  name: "Crop9"
  type: "Crop"
  bottom: "label"
  bottom: "DummyData9"
  top: "Crop9"
  crop_param {
    axis: 1
    offset: 15
    offset: 0
    offset: 0
  }
}
layer {
  name: "Concat54"
  type: "Concat"
  bottom: "Concat53"
  bottom: "Crop9"
  top: "Concat54"
  concat_param {
    axis: 1
  }
}
layer {
  name: "DummyData10"
  type: "DummyData"
  top: "DummyData10"
  dummy_data_param {
    shape {
      dim: 1
      dim: 1
      dim: 256
      dim: 256
    }
  }
}
layer {
  name: "Crop10"
  type: "Crop"
  bottom: "label"
  bottom: "DummyData10"
  top: "Crop10"
  crop_param {
    axis: 1
    offset: 20
    offset: 0
    offset: 0
  }
}
layer {
  name: "Concat55"
  type: "Concat"
  bottom: "Concat54"
  bottom: "Crop10"
  top: "Concat55"
  concat_param {
    axis: 1
  }
}
layer {
  name: "DummyData11"
  type: "DummyData"
  top: "DummyData11"
  dummy_data_param {
    shape {
      dim: 1
      dim: 1
      dim: 256
      dim: 256
    }
  }
}
layer {
  name: "Crop11"
  type: "Crop"
  bottom: "label"
  bottom: "DummyData11"
  top: "Crop11"
  crop_param {
    axis: 1
    offset: 1
    offset: 0
    offset: 0
  }
}
layer {
  name: "Concat56"
  type: "Concat"
  bottom: "Concat55"
  bottom: "Crop11"
  top: "Concat56"
  concat_param {
    axis: 1
  }
}
layer {
  name: "DummyData12"
  type: "DummyData"
  top: "DummyData12"
  dummy_data_param {
    shape {
      dim: 1
      dim: 1
      dim: 256
      dim: 256
    }
  }
}
layer {
  name: "Crop12"
  type: "Crop"
  bottom: "label"
  bottom: "DummyData12"
  top: "Crop12"
  crop_param {
    axis: 1
    offset: 6
    offset: 0
    offset: 0
  }
}
layer {
  name: "Concat57"
  type: "Concat"
  bottom: "Concat56"
  bottom: "Crop12"
  top: "Concat57"
  concat_param {
    axis: 1
  }
}
layer {
  name: "DummyData13"
  type: "DummyData"
  top: "DummyData13"
  dummy_data_param {
    shape {
      dim: 1
      dim: 1
      dim: 256
      dim: 256
    }
  }
}
layer {
  name: "Crop13"
  type: "Crop"
  bottom: "label"
  bottom: "DummyData13"
  top: "Crop13"
  crop_param {
    axis: 1
    offset: 11
    offset: 0
    offset: 0
  }
}
layer {
  name: "Concat58"
  type: "Concat"
  bottom: "Concat57"
  bottom: "Crop13"
  top: "Concat58"
  concat_param {
    axis: 1
  }
}
layer {
  name: "DummyData14"
  type: "DummyData"
  top: "DummyData14"
  dummy_data_param {
    shape {
      dim: 1
      dim: 1
      dim: 256
      dim: 256
    }
  }
}
layer {
  name: "Crop14"
  type: "Crop"
  bottom: "label"
  bottom: "DummyData14"
  top: "Crop14"
  crop_param {
    axis: 1
    offset: 16
    offset: 0
    offset: 0
  }
}
layer {
  name: "Concat59"
  type: "Concat"
  bottom: "Concat58"
  bottom: "Crop14"
  top: "Concat59"
  concat_param {
    axis: 1
  }
}
layer {
  name: "DummyData15"
  type: "DummyData"
  top: "DummyData15"
  dummy_data_param {
    shape {
      dim: 1
      dim: 1
      dim: 256
      dim: 256
    }
  }
}
layer {
  name: "Crop15"
  type: "Crop"
  bottom: "label"
  bottom: "DummyData15"
  top: "Crop15"
  crop_param {
    axis: 1
    offset: 21
    offset: 0
    offset: 0
  }
}
layer {
  name: "Concat60"
  type: "Concat"
  bottom: "Concat59"
  bottom: "Crop15"
  top: "Concat60"
  concat_param {
    axis: 1
  }
}
layer {
  name: "DummyData16"
  type: "DummyData"
  top: "DummyData16"
  dummy_data_param {
    shape {
      dim: 1
      dim: 1
      dim: 256
      dim: 256
    }
  }
}
layer {
  name: "Crop16"
  type: "Crop"
  bottom: "label"
  bottom: "DummyData16"
  top: "Crop16"
  crop_param {
    axis: 1
    offset: 2
    offset: 0
    offset: 0
  }
}
layer {
  name: "Concat61"
  type: "Concat"
  bottom: "Concat60"
  bottom: "Crop16"
  top: "Concat61"
  concat_param {
    axis: 1
  }
}
layer {
  name: "DummyData17"
  type: "DummyData"
  top: "DummyData17"
  dummy_data_param {
    shape {
      dim: 1
      dim: 1
      dim: 256
      dim: 256
    }
  }
}
layer {
  name: "Crop17"
  type: "Crop"
  bottom: "label"
  bottom: "DummyData17"
  top: "Crop17"
  crop_param {
    axis: 1
    offset: 7
    offset: 0
    offset: 0
  }
}
layer {
  name: "Concat62"
  type: "Concat"
  bottom: "Concat61"
  bottom: "Crop17"
  top: "Concat62"
  concat_param {
    axis: 1
  }
}
layer {
  name: "DummyData18"
  type: "DummyData"
  top: "DummyData18"
  dummy_data_param {
    shape {
      dim: 1
      dim: 1
      dim: 256
      dim: 256
    }
  }
}
layer {
  name: "Crop18"
  type: "Crop"
  bottom: "label"
  bottom: "DummyData18"
  top: "Crop18"
  crop_param {
    axis: 1
    offset: 12
    offset: 0
    offset: 0
  }
}
layer {
  name: "Concat63"
  type: "Concat"
  bottom: "Concat62"
  bottom: "Crop18"
  top: "Concat63"
  concat_param {
    axis: 1
  }
}
layer {
  name: "DummyData19"
  type: "DummyData"
  top: "DummyData19"
  dummy_data_param {
    shape {
      dim: 1
      dim: 1
      dim: 256
      dim: 256
    }
  }
}
layer {
  name: "Crop19"
  type: "Crop"
  bottom: "label"
  bottom: "DummyData19"
  top: "Crop19"
  crop_param {
    axis: 1
    offset: 17
    offset: 0
    offset: 0
  }
}
layer {
  name: "Concat64"
  type: "Concat"
  bottom: "Concat63"
  bottom: "Crop19"
  top: "Concat64"
  concat_param {
    axis: 1
  }
}
layer {
  name: "DummyData20"
  type: "DummyData"
  top: "DummyData20"
  dummy_data_param {
    shape {
      dim: 1
      dim: 1
      dim: 256
      dim: 256
    }
  }
}
layer {
  name: "Crop20"
  type: "Crop"
  bottom: "label"
  bottom: "DummyData20"
  top: "Crop20"
  crop_param {
    axis: 1
    offset: 22
    offset: 0
    offset: 0
  }
}
layer {
  name: "Concat65"
  type: "Concat"
  bottom: "Concat64"
  bottom: "Crop20"
  top: "Concat65"
  concat_param {
    axis: 1
  }
}
layer {
  name: "DummyData21"
  type: "DummyData"
  top: "DummyData21"
  dummy_data_param {
    shape {
      dim: 1
      dim: 1
      dim: 256
