layer {
  name: "input"
  type: "Input"
  top: "input"
  input_param {
    shape {
      dim: 1
      dim: 1
      dim: 256
      dim: 256
    }
  }
}
layer {
  name: "input_color"
  type: "Input"
  top: "input_color"
  input_param {
    shape {
      dim: 1
      dim: 3
      dim: 256
      dim: 256
    }
  }
}
layer {
  name: "Convolution1"
  type: "Convolution"
  bottom: "input"
  top: "Convolution1"
  convolution_param {
    num_output: 50
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU1"
  type: "ReLU"
  bottom: "Convolution1"
  top: "Convolution1"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution2"
  type: "Convolution"
  bottom: "Convolution1"
  top: "Convolution2"
  convolution_param {
    num_output: 50
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 50
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "Convolution3"
  type: "Convolution"
  bottom: "Convolution2"
  top: "Convolution3"
  convolution_param {
    num_output: 50
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU2"
  type: "ReLU"
  bottom: "Convolution3"
  top: "Convolution3"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Pooling1"
  type: "Pooling"
  bottom: "Convolution3"
  top: "Pooling1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU3"
  type: "ReLU"
  bottom: "Pooling1"
  top: "Pooling1"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution4"
  type: "Convolution"
  bottom: "Pooling1"
  top: "Convolution4"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU4"
  type: "ReLU"
  bottom: "Convolution4"
  top: "Convolution4"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution5"
  type: "Convolution"
  bottom: "Convolution4"
  top: "Convolution5"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 64
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "Convolution6"
  type: "Convolution"
  bottom: "Convolution5"
  top: "Convolution6"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU5"
  type: "ReLU"
  bottom: "Convolution6"
  top: "Convolution6"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Pooling2"
  type: "Pooling"
  bottom: "Convolution6"
  top: "Pooling2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU6"
  type: "ReLU"
  bottom: "Pooling2"
  top: "Pooling2"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution7"
  type: "Convolution"
  bottom: "Pooling2"
  top: "Convolution7"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU7"
  type: "ReLU"
  bottom: "Convolution7"
  top: "Convolution7"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution8"
  type: "Convolution"
  bottom: "Convolution7"
  top: "Convolution8"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 64
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "Convolution9"
  type: "Convolution"
  bottom: "Convolution8"
  top: "Convolution9"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU8"
  type: "ReLU"
  bottom: "Convolution9"
  top: "Convolution9"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Pooling3"
  type: "Pooling"
  bottom: "Convolution9"
  top: "Pooling3"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU9"
  type: "ReLU"
  bottom: "Pooling3"
  top: "Pooling3"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution10"
  type: "Convolution"
  bottom: "Pooling3"
  top: "Convolution10"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU10"
  type: "ReLU"
  bottom: "Convolution10"
  top: "Convolution10"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution11"
  type: "Convolution"
  bottom: "Convolution10"
  top: "Convolution11"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 128
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "Convolution12"
  type: "Convolution"
  bottom: "Convolution11"
  top: "Convolution12"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU11"
  type: "ReLU"
  bottom: "Convolution12"
  top: "Convolution12"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Pooling4"
  type: "Pooling"
  bottom: "Convolution12"
  top: "Pooling4"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU12"
  type: "ReLU"
  bottom: "Pooling4"
  top: "Pooling4"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution13"
  type: "Convolution"
  bottom: "Pooling4"
  top: "Convolution13"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU13"
  type: "ReLU"
  bottom: "Convolution13"
  top: "Convolution13"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution14"
  type: "Convolution"
  bottom: "Convolution13"
  top: "Convolution14"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 256
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "Convolution15"
  type: "Convolution"
  bottom: "Convolution14"
  top: "Convolution15"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU14"
  type: "ReLU"
  bottom: "Convolution15"
  top: "Convolution15"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Pooling5"
  type: "Pooling"
  bottom: "Convolution15"
  top: "Pooling5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU15"
  type: "ReLU"
  bottom: "Pooling5"
  top: "Pooling5"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution16"
  type: "Convolution"
  bottom: "Pooling5"
  top: "Convolution16"
  convolution_param {
    num_output: 512
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU16"
  type: "ReLU"
  bottom: "Convolution16"
  top: "Convolution16"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution17"
  type: "Convolution"
  bottom: "Convolution16"
  top: "Convolution17"
  convolution_param {
    num_output: 512
    bias_term: true
    pad: 3
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 3
  }
}
layer {
  name: "ReLU17"
  type: "ReLU"
  bottom: "Convolution17"
  top: "Convolution17"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution18"
  type: "Convolution"
  bottom: "Convolution17"
  top: "Convolution18"
  convolution_param {
    num_output: 512
    bias_term: true
    pad: 6
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 6
  }
}
layer {
  name: "Eltwise1"
  type: "Eltwise"
  bottom: "Convolution18"
  bottom: "Convolution16"
  top: "Eltwise1"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "ReLU18"
  type: "ReLU"
  bottom: "Eltwise1"
  top: "Eltwise1"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Deconvolution1"
  type: "Deconvolution"
  bottom: "Eltwise1"
  top: "Deconvolution1"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 4
    stride: 2
  }
}
layer {
  name: "ReLU19"
  type: "ReLU"
  bottom: "Deconvolution1"
  top: "Deconvolution1"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Concat1"
  type: "Concat"
  bottom: "Deconvolution1"
  bottom: "Convolution15"
  top: "Concat1"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Convolution19"
  type: "Convolution"
  bottom: "Concat1"
  top: "Convolution19"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU20"
  type: "ReLU"
  bottom: "Convolution19"
  top: "Convolution19"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution20"
  type: "Convolution"
  bottom: "Convolution19"
  top: "Convolution20"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 256
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "Convolution21"
  type: "Convolution"
  bottom: "Convolution20"
  top: "Convolution21"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU21"
  type: "ReLU"
  bottom: "Convolution21"
  top: "Convolution21"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Deconvolution2"
  type: "Deconvolution"
  bottom: "Convolution21"
  top: "Deconvolution2"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 4
    stride: 2
  }
}
layer {
  name: "ReLU22"
  type: "ReLU"
  bottom: "Deconvolution2"
  top: "Deconvolution2"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Concat2"
  type: "Concat"
  bottom: "Deconvolution2"
  bottom: "Convolution12"
  top: "Concat2"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Convolution22"
  type: "Convolution"
  bottom: "Concat2"
  top: "Convolution22"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU23"
  type: "ReLU"
  bottom: "Convolution22"
  top: "Convolution22"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution23"
  type: "Convolution"
  bottom: "Convolution22"
  top: "Convolution23"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 128
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "Convolution24"
  type: "Convolution"
  bottom: "Convolution23"
  top: "Convolution24"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU24"
  type: "ReLU"
  bottom: "Convolution24"
  top: "Convolution24"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Deconvolution3"
  type: "Deconvolution"
  bottom: "Convolution24"
  top: "Deconvolution3"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 4
    stride: 2
  }
}
layer {
  name: "ReLU25"
  type: "ReLU"
  bottom: "Deconvolution3"
  top: "Deconvolution3"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Concat3"
  type: "Concat"
  bottom: "Deconvolution3"
  bottom: "Convolution9"
  top: "Concat3"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Convolution25"
  type: "Convolution"
  bottom: "Concat3"
  top: "Convolution25"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU26"
  type: "ReLU"
  bottom: "Convolution25"
  top: "Convolution25"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution26"
  type: "Convolution"
  bottom: "Convolution25"
  top: "Convolution26"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 64
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "Convolution27"
  type: "Convolution"
  bottom: "Convolution26"
  top: "Convolution27"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU27"
  type: "ReLU"
  bottom: "Convolution27"
  top: "Convolution27"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Deconvolution4"
  type: "Deconvolution"
  bottom: "Convolution27"
  top: "Deconvolution4"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 4
    stride: 2
  }
}
layer {
  name: "ReLU28"
  type: "ReLU"
  bottom: "Deconvolution4"
  top: "Deconvolution4"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Concat4"
  type: "Concat"
  bottom: "Deconvolution4"
  bottom: "Convolution6"
  top: "Concat4"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Convolution28"
  type: "Convolution"
  bottom: "Concat4"
  top: "Convolution28"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU29"
  type: "ReLU"
  bottom: "Convolution28"
  top: "Convolution28"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution29"
  type: "Convolution"
  bottom: "Convolution28"
  top: "Convolution29"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 64
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "Convolution30"
  type: "Convolution"
  bottom: "Convolution29"
  top: "Convolution30"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU30"
  type: "ReLU"
  bottom: "Convolution30"
  top: "Convolution30"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Deconvolution5"
  type: "Deconvolution"
  bottom: "Convolution30"
  top: "Deconvolution5"
  convolution_param {
    num_output: 50
    pad: 1
    kernel_size: 4
    stride: 2
  }
}
layer {
  name: "ReLU31"
  type: "ReLU"
  bottom: "Deconvolution5"
  top: "Deconvolution5"
  relu_param {
    negative_slope: 0.2
  }
}
layer {
  name: "Concat5"
  type: "Concat"
  bottom: "Deconvolution5"
  bottom: "Convolution3"
  top: "Concat5"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Convolution31"
  type: "Convolution"
  bottom: "Concat5"
  top: "Convolution31"
  convolution_param {
    num_output: 50
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "ReLU32"
  type: "ReLU"
  bottom: "Convolution31"
  top: "Convolution31"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "Convolution32"
  type: "Convolution"
  bottom: "Convolution31"
  top: "Convolution32"
  convolution_param {
    num_output: 50
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 50
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "Convolution33"
  type: "Convolution"
  bottom: "Convolution32"
  top: "Convolution33"
  convolution_param {
    num_output: 50
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "msra"
    }
    engine: CAFFE
    dilation: 1
  }
}
layer {
  name: "flow"
  type: "ReLU"
  bottom: "Convolution33"
  top: "Convolution33"
  relu_param {
    negative_slope: 0.2
    engine: CAFFE
  }
}
layer {
  name: "flow_h"
  type: "Slice"
  bottom: "Convolution33"
  top: "flow_h"
  top: "flow_v"
  slice_param {
    slice_dim: 1
    slice_point: 25
  }
}
layer {
  name: "Slice1"
  type: "Slice"
  bottom: "flow_v"
  top: "Slice1"
  top: "Slice2"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice3"
  type: "Slice"
  bottom: "flow_h"
  top: "Slice3"
  top: "Slice4"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Concat6"
  type: "Concat"
  bottom: "Slice1"
  bottom: "Slice3"
  top: "Concat6"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python1"
  type: "Python"
  bottom: "input_color"
  bottom: "Concat6"
  top: "Python1"
  python_param {
    module: "warping_layer"
    layer: "WarpingLayer"
  }
}
layer {
  name: "Slice5"
  type: "Slice"
  bottom: "Slice2"
  top: "Slice5"
  top: "Slice6"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice7"
  type: "Slice"
  bottom: "Slice4"
  top: "Slice7"
  top: "Slice8"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Concat7"
  type: "Concat"
  bottom: "Slice5"
  bottom: "Slice7"
  top: "Concat7"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python2"
  type: "Python"
  bottom: "input_color"
  bottom: "Concat7"
  top: "Python2"
  python_param {
    module: "warping_layer"
    layer: "WarpingLayer"
  }
}
layer {
  name: "Concat8"
  type: "Concat"
  bottom: "Python1"
  bottom: "Python2"
  top: "Concat8"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice9"
  type: "Slice"
  bottom: "Slice6"
  top: "Slice9"
  top: "Slice10"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice11"
  type: "Slice"
  bottom: "Slice8"
  top: "Slice11"
  top: "Slice12"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Concat9"
  type: "Concat"
  bottom: "Slice9"
  bottom: "Slice11"
  top: "Concat9"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python3"
  type: "Python"
  bottom: "input_color"
  bottom: "Concat9"
  top: "Python3"
  python_param {
    module: "warping_layer"
    layer: "WarpingLayer"
  }
}
layer {
  name: "Concat10"
  type: "Concat"
  bottom: "Concat8"
  bottom: "Python3"
  top: "Concat10"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice13"
  type: "Slice"
  bottom: "Slice10"
  top: "Slice13"
  top: "Slice14"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice15"
  type: "Slice"
  bottom: "Slice12"
  top: "Slice15"
  top: "Slice16"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Concat11"
  type: "Concat"
  bottom: "Slice13"
  bottom: "Slice15"
  top: "Concat11"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python4"
  type: "Python"
  bottom: "input_color"
  bottom: "Concat11"
  top: "Python4"
  python_param {
    module: "warping_layer"
    layer: "WarpingLayer"
  }
}
layer {
  name: "Concat12"
  type: "Concat"
  bottom: "Concat10"
  bottom: "Python4"
  top: "Concat12"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice17"
  type: "Slice"
  bottom: "Slice14"
  top: "Slice17"
  top: "Slice18"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice19"
  type: "Slice"
  bottom: "Slice16"
  top: "Slice19"
  top: "Slice20"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Concat13"
  type: "Concat"
  bottom: "Slice17"
  bottom: "Slice19"
  top: "Concat13"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python5"
  type: "Python"
  bottom: "input_color"
  bottom: "Concat13"
  top: "Python5"
  python_param {
    module: "warping_layer"
    layer: "WarpingLayer"
  }
}
layer {
  name: "Concat14"
  type: "Concat"
  bottom: "Concat12"
  bottom: "Python5"
  top: "Concat14"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice21"
  type: "Slice"
  bottom: "Slice18"
  top: "Slice21"
  top: "Slice22"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice23"
  type: "Slice"
  bottom: "Slice20"
  top: "Slice23"
  top: "Slice24"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Concat15"
  type: "Concat"
  bottom: "Slice21"
  bottom: "Slice23"
  top: "Concat15"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python6"
  type: "Python"
  bottom: "input_color"
  bottom: "Concat15"
  top: "Python6"
  python_param {
    module: "warping_layer"
    layer: "WarpingLayer"
  }
}
layer {
  name: "Concat16"
  type: "Concat"
  bottom: "Concat14"
  bottom: "Python6"
  top: "Concat16"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice25"
  type: "Slice"
  bottom: "Slice22"
  top: "Slice25"
  top: "Slice26"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice27"
  type: "Slice"
  bottom: "Slice24"
  top: "Slice27"
  top: "Slice28"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Concat17"
  type: "Concat"
  bottom: "Slice25"
  bottom: "Slice27"
  top: "Concat17"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python7"
  type: "Python"
  bottom: "input_color"
  bottom: "Concat17"
  top: "Python7"
  python_param {
    module: "warping_layer"
    layer: "WarpingLayer"
  }
}
layer {
  name: "Concat18"
  type: "Concat"
  bottom: "Concat16"
  bottom: "Python7"
  top: "Concat18"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice29"
  type: "Slice"
  bottom: "Slice26"
  top: "Slice29"
  top: "Slice30"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice31"
  type: "Slice"
  bottom: "Slice28"
  top: "Slice31"
  top: "Slice32"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Concat19"
  type: "Concat"
  bottom: "Slice29"
  bottom: "Slice31"
  top: "Concat19"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python8"
  type: "Python"
  bottom: "input_color"
  bottom: "Concat19"
  top: "Python8"
  python_param {
    module: "warping_layer"
    layer: "WarpingLayer"
  }
}
layer {
  name: "Concat20"
  type: "Concat"
  bottom: "Concat18"
  bottom: "Python8"
  top: "Concat20"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice33"
  type: "Slice"
  bottom: "Slice30"
  top: "Slice33"
  top: "Slice34"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice35"
  type: "Slice"
  bottom: "Slice32"
  top: "Slice35"
  top: "Slice36"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Concat21"
  type: "Concat"
  bottom: "Slice33"
  bottom: "Slice35"
  top: "Concat21"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python9"
  type: "Python"
  bottom: "input_color"
  bottom: "Concat21"
  top: "Python9"
  python_param {
    module: "warping_layer"
    layer: "WarpingLayer"
  }
}
layer {
  name: "Concat22"
  type: "Concat"
  bottom: "Concat20"
  bottom: "Python9"
  top: "Concat22"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice37"
  type: "Slice"
  bottom: "Slice34"
  top: "Slice37"
  top: "Slice38"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice39"
  type: "Slice"
  bottom: "Slice36"
  top: "Slice39"
  top: "Slice40"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Concat23"
  type: "Concat"
  bottom: "Slice37"
  bottom: "Slice39"
  top: "Concat23"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python10"
  type: "Python"
  bottom: "input_color"
  bottom: "Concat23"
  top: "Python10"
  python_param {
    module: "warping_layer"
    layer: "WarpingLayer"
  }
}
layer {
  name: "Concat24"
  type: "Concat"
  bottom: "Concat22"
  bottom: "Python10"
  top: "Concat24"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice41"
  type: "Slice"
  bottom: "Slice38"
  top: "Slice41"
  top: "Slice42"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice43"
  type: "Slice"
  bottom: "Slice40"
  top: "Slice43"
  top: "Slice44"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Concat25"
  type: "Concat"
  bottom: "Slice41"
  bottom: "Slice43"
  top: "Concat25"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python11"
  type: "Python"
  bottom: "input_color"
  bottom: "Concat25"
  top: "Python11"
  python_param {
    module: "warping_layer"
    layer: "WarpingLayer"
  }
}
layer {
  name: "Concat26"
  type: "Concat"
  bottom: "Concat24"
  bottom: "Python11"
  top: "Concat26"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice45"
  type: "Slice"
  bottom: "Slice42"
  top: "Slice45"
  top: "Slice46"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice47"
  type: "Slice"
  bottom: "Slice44"
  top: "Slice47"
  top: "Slice48"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Concat27"
  type: "Concat"
  bottom: "Slice45"
  bottom: "Slice47"
  top: "Concat27"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python12"
  type: "Python"
  bottom: "input_color"
  bottom: "Concat27"
  top: "Python12"
  python_param {
    module: "warping_layer"
    layer: "WarpingLayer"
  }
}
layer {
  name: "Concat28"
  type: "Concat"
  bottom: "Concat26"
  bottom: "Python12"
  top: "Concat28"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice49"
  type: "Slice"
  bottom: "Slice46"
  top: "Slice49"
  top: "Slice50"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice51"
  type: "Slice"
  bottom: "Slice48"
  top: "Slice51"
  top: "Slice52"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Concat29"
  type: "Concat"
  bottom: "Slice49"
  bottom: "Slice51"
  top: "Concat29"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python13"
  type: "Python"
  bottom: "input_color"
  bottom: "Concat29"
  top: "Python13"
  python_param {
    module: "warping_layer"
    layer: "WarpingLayer"
  }
}
layer {
  name: "Concat30"
  type: "Concat"
  bottom: "Concat28"
  bottom: "Python13"
  top: "Concat30"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice53"
  type: "Slice"
  bottom: "Slice50"
  top: "Slice53"
  top: "Slice54"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice55"
  type: "Slice"
  bottom: "Slice52"
  top: "Slice55"
  top: "Slice56"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Concat31"
  type: "Concat"
  bottom: "Slice53"
  bottom: "Slice55"
  top: "Concat31"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python14"
  type: "Python"
  bottom: "input_color"
  bottom: "Concat31"
  top: "Python14"
  python_param {
    module: "warping_layer"
    layer: "WarpingLayer"
  }
}
layer {
  name: "Concat32"
  type: "Concat"
  bottom: "Concat30"
  bottom: "Python14"
  top: "Concat32"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice57"
  type: "Slice"
  bottom: "Slice54"
  top: "Slice57"
  top: "Slice58"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice59"
  type: "Slice"
  bottom: "Slice56"
  top: "Slice59"
  top: "Slice60"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Concat33"
  type: "Concat"
  bottom: "Slice57"
  bottom: "Slice59"
  top: "Concat33"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python15"
  type: "Python"
  bottom: "input_color"
  bottom: "Concat33"
  top: "Python15"
  python_param {
    module: "warping_layer"
    layer: "WarpingLayer"
  }
}
layer {
  name: "Concat34"
  type: "Concat"
  bottom: "Concat32"
  bottom: "Python15"
  top: "Concat34"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice61"
  type: "Slice"
  bottom: "Slice58"
  top: "Slice61"
  top: "Slice62"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice63"
  type: "Slice"
  bottom: "Slice60"
  top: "Slice63"
  top: "Slice64"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Concat35"
  type: "Concat"
  bottom: "Slice61"
  bottom: "Slice63"
  top: "Concat35"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python16"
  type: "Python"
  bottom: "input_color"
  bottom: "Concat35"
  top: "Python16"
  python_param {
    module: "warping_layer"
    layer: "WarpingLayer"
  }
}
layer {
  name: "Concat36"
  type: "Concat"
  bottom: "Concat34"
  bottom: "Python16"
  top: "Concat36"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice65"
  type: "Slice"
  bottom: "Slice62"
  top: "Slice65"
  top: "Slice66"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice67"
  type: "Slice"
  bottom: "Slice64"
  top: "Slice67"
  top: "Slice68"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Concat37"
  type: "Concat"
  bottom: "Slice65"
  bottom: "Slice67"
  top: "Concat37"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python17"
  type: "Python"
  bottom: "input_color"
  bottom: "Concat37"
  top: "Python17"
  python_param {
    module: "warping_layer"
    layer: "WarpingLayer"
  }
}
layer {
  name: "Concat38"
  type: "Concat"
  bottom: "Concat36"
  bottom: "Python17"
  top: "Concat38"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice69"
  type: "Slice"
  bottom: "Slice66"
  top: "Slice69"
  top: "Slice70"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice71"
  type: "Slice"
  bottom: "Slice68"
  top: "Slice71"
  top: "Slice72"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Concat39"
  type: "Concat"
  bottom: "Slice69"
  bottom: "Slice71"
  top: "Concat39"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python18"
  type: "Python"
  bottom: "input_color"
  bottom: "Concat39"
  top: "Python18"
  python_param {
    module: "warping_layer"
    layer: "WarpingLayer"
  }
}
layer {
  name: "Concat40"
  type: "Concat"
  bottom: "Concat38"
  bottom: "Python18"
  top: "Concat40"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice73"
  type: "Slice"
  bottom: "Slice70"
  top: "Slice73"
  top: "Slice74"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice75"
  type: "Slice"
  bottom: "Slice72"
  top: "Slice75"
  top: "Slice76"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Concat41"
  type: "Concat"
  bottom: "Slice73"
  bottom: "Slice75"
  top: "Concat41"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python19"
  type: "Python"
  bottom: "input_color"
  bottom: "Concat41"
  top: "Python19"
  python_param {
    module: "warping_layer"
    layer: "WarpingLayer"
  }
}
layer {
  name: "Concat42"
  type: "Concat"
  bottom: "Concat40"
  bottom: "Python19"
  top: "Concat42"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice77"
  type: "Slice"
  bottom: "Slice74"
  top: "Slice77"
  top: "Slice78"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice79"
  type: "Slice"
  bottom: "Slice76"
  top: "Slice79"
  top: "Slice80"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Concat43"
  type: "Concat"
  bottom: "Slice77"
  bottom: "Slice79"
  top: "Concat43"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python20"
  type: "Python"
  bottom: "input_color"
  bottom: "Concat43"
  top: "Python20"
  python_param {
    module: "warping_layer"
    layer: "WarpingLayer"
  }
}
layer {
  name: "Concat44"
  type: "Concat"
  bottom: "Concat42"
  bottom: "Python20"
  top: "Concat44"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice81"
  type: "Slice"
  bottom: "Slice78"
  top: "Slice81"
  top: "Slice82"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice83"
  type: "Slice"
  bottom: "Slice80"
  top: "Slice83"
  top: "Slice84"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Concat45"
  type: "Concat"
  bottom: "Slice81"
  bottom: "Slice83"
  top: "Concat45"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python21"
  type: "Python"
  bottom: "input_color"
  bottom: "Concat45"
  top: "Python21"
  python_param {
    module: "warping_layer"
    layer: "WarpingLayer"
  }
}
layer {
  name: "Concat46"
  type: "Concat"
  bottom: "Concat44"
  bottom: "Python21"
  top: "Concat46"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice85"
  type: "Slice"
  bottom: "Slice82"
  top: "Slice85"
  top: "Slice86"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice87"
  type: "Slice"
  bottom: "Slice84"
  top: "Slice87"
  top: "Slice88"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Concat47"
  type: "Concat"
  bottom: "Slice85"
  bottom: "Slice87"
  top: "Concat47"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python22"
  type: "Python"
  bottom: "input_color"
  bottom: "Concat47"
  top: "Python22"
  python_param {
    module: "warping_layer"
    layer: "WarpingLayer"
  }
}
layer {
  name: "Concat48"
  type: "Concat"
  bottom: "Concat46"
  bottom: "Python22"
  top: "Concat48"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice89"
  type: "Slice"
  bottom: "Slice86"
  top: "Slice89"
  top: "Slice90"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice91"
  type: "Slice"
  bottom: "Slice88"
  top: "Slice91"
  top: "Slice92"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Concat49"
  type: "Concat"
  bottom: "Slice89"
  bottom: "Slice91"
  top: "Concat49"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python23"
  type: "Python"
  bottom: "input_color"
  bottom: "Concat49"
  top: "Python23"
  python_param {
    module: "warping_layer"
    layer: "WarpingLayer"
  }
}
layer {
  name: "Concat50"
  type: "Concat"
  bottom: "Concat48"
  bottom: "Python23"
  top: "Concat50"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Slice93"
  type: "Slice"
  bottom: "Slice90"
  top: "Slice93"
  top: "Slice94"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Slice95"
  type: "Slice"
  bottom: "Slice92"
  top: "Slice95"
  top: "Slice96"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "Concat51"
  type: "Concat"
  bottom: "Slice93"
  bottom: "Slice95"
  top: "Concat51"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python24"
  type: "Python"
  bottom: "input_color"
  bottom: "Concat51"
  top: "Python24"
  python_param {
    module: "warping_layer"
    layer: "WarpingLayer"
  }
}
layer {
  name: "Concat52"
  type: "Concat"
  bottom: "Concat50"
  bottom: "Python24"
  top: "Concat52"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Concat53"
  type: "Concat"
  bottom: "Slice94"
  bottom: "Slice96"
  top: "Concat53"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Python25"
  type: "Python"
  bottom: "input_color"
  bottom: "Concat53"
  top: "Python25"
  python_param {
    module: "warping_layer"
    layer: "WarpingLayer"
  }
}
layer {
  name: "predict"
  type: "Concat"
  bottom: "Concat52"
  bottom: "Python25"
  top: "predict"
  concat_param {
    axis: 1
  }
}
